

<!DOCTYPE html>
<html lang>
<head prefix="og: http://ogp.me/ns#"><meta name="generator" content="Hexo 3.9.0">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content>
    <title>20171030 | generaltune&#39;s blog</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#x672A;&amp;#x6765;&amp;#x7684;CSS&amp;#x592A;&amp;#x8BA9;&amp;#x4EBA;&amp;#x5174;&amp;#x594B;&amp;#x4E86;&amp;#xFF1A;&amp;#x4E00;&amp;#x65B9;&amp;#x9762;&amp;#xFF0C;&amp;#x662F;&amp;#x5168;&amp;#x65B0;&amp;#x7684;&amp;#x9875;&amp;#x9762;&amp;#x5E03;&amp;#x5C40;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF">
<meta property="og:type" content="article">
<meta property="og:title" content="20171030">
<meta property="og:url" content="https://generaltune.github.io/blog/2017/10/30/css总结/index.html">
<meta property="og:site_name" content="generaltune&#39;s blog">
<meta property="og:description" content="&amp;#x672A;&amp;#x6765;&amp;#x7684;CSS&amp;#x592A;&amp;#x8BA9;&amp;#x4EBA;&amp;#x5174;&amp;#x594B;&amp;#x4E86;&amp;#xFF1A;&amp;#x4E00;&amp;#x65B9;&amp;#x9762;&amp;#xFF0C;&amp;#x662F;&amp;#x5168;&amp;#x65B0;&amp;#x7684;&amp;#x9875;&amp;#x9762;&amp;#x5E03;&amp;#x5C40;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF">
<meta property="og:locale" content="default">
<meta property="og:updated_time" content="2019-07-03T03:52:29.684Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="20171030">
<meta name="twitter:description" content="&amp;#x672A;&amp;#x6765;&amp;#x7684;CSS&amp;#x592A;&amp;#x8BA9;&amp;#x4EBA;&amp;#x5174;&amp;#x594B;&amp;#x4E86;&amp;#xFF1A;&amp;#x4E00;&amp;#x65B9;&amp;#x9762;&amp;#xFF0C;&amp;#x662F;&amp;#x5168;&amp;#x65B0;&amp;#x7684;&amp;#x9875;&amp;#x9762;&amp;#x5E03;&amp;#x5C40;&amp;#x65B9;&amp;#x5F0F;&amp;#xFF">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "GENERALTUNE",
  "url": "https://generaltune.github.io/blog"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/blog/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>generaltune&#39;s blog</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/blog/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">GENERALTUNE</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item">
        <i class="home icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-css总结" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    20171030
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>&#x672A;&#x6765;&#x7684;CSS&#x592A;&#x8BA9;&#x4EBA;&#x5174;&#x594B;&#x4E86;&#xFF1A;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x662F;&#x5168;&#x65B0;&#x7684;&#x9875;&#x9762;&#x5E03;&#x5C40;&#x65B9;&#x5F0F;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x662F;&#x9177;&#x70AB;&#x7684;&#x6EE4;&#x955C;&#x3001;&#x989C;&#x8272;&#x7B49;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x3002;&#x8FD9;&#x4E9B;CSS&#xFF0C;&#x53D7;&#x5F00;&#x53D1;&#x8005;&#x8FFD;&#x6367;&#xFF0C;&#x88AB;&#x6742;&#x5FD7;&#x548C;&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#x94FA;&#x5929;&#x76D6;&#x5730;&#x5730;&#x4ECB;&#x7ECD;&#x3002;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x8BF4;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x662F;CSS&#x534E;&#x4E3D;&#x7684;&#x4E00;&#x9762;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5B83;&#x6734;&#x5B9E;&#x7684;&#x4E00;&#x9762;&#xFF1A;&#x5F88;&#x4E0D;&#x8D77;&#x773C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5982;&#x9009;&#x62E9;&#x5668;&#x3001;&#x5355;&#x4F4D;&#x3001;&#x51FD;&#x6570;&#xFF08;&#x65B9;&#x6CD5;&#xFF09;&#x3002;&#x6211;&#x7ECF;&#x5E38;&#x8BF4;&#x8FD9;&#x662F;&#x7E41;&#x7410;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x6211;&#x610F;&#x601D;&#x662F;&#x5B83;&#x4EEC;&#x80FD;&#x5E72;&#x6F02;&#x4EAE;&#x7684;&#x6D3B;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x8981;&#x5206;&#x4EAB;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x600E;&#x4E48;&#x8BF4;&#x5462;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x8FD9;&#x4E9B;&#x6548;&#x679C;&#x6700;&#x597D;&#x7684;&#x6734;&#x5B9E;&#x7684;CSS&#x7EC6;&#x8282;&#x2014;&#x2014;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x8FDC;&#x8FDC;&#x6CA1;&#x6709;&#x90A3;&#x4E9B;&#x9177;&#x70AB;&#x7684;CSS&#x6548;&#x679C;&#x90A3;&#x4E48;&#x5F15;&#x4EBA;&#x6CE8;&#x76EE;&#x3002;&#x5B83;&#x4EEC;&#x6709;&#x4E9B;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x4F46;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x66F4;&#x597D;&#x5730;&#x8BA4;&#x8BC6;&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x5219;&#x521A;&#x521A;&#x9762;&#x4E16;&#x3002;&#x867D;&#x7136;&#x4E0D;&#x8D77;&#x773C;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x2014;&#x2014;&#x4EE5;&#x8C26;&#x865A;&#x7684;&#x59FF;&#x6001;&#x3002;<br>&#x76F8;&#x5BF9;&#x5355;&#x4F4D;<br>&#x3000;&#x3000;&#x806A;&#x660E;&#x53C8;&#x6709;&#x524D;&#x77BB;&#x5934;&#x8111;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4EEC;&#x5DF2;&#x7ECF;&#x4F7F;&#x7528;&#x76F8;&#x5BF9;&#x5355;&#x4F4D;&#x4E86;&#x2014;&#x2014;&#x5982;em&#x6216;&#x8005;&#x767E;&#x5206;&#x6BD4;&#x2014;&#x2014;&#x6240;&#x4EE5;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x4EEC;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x5F80;&#x5F80;&#x56E0;&#x4E3A;&#x5143;&#x7D20;&#x7684;&#x7EE7;&#x627F;&#x6027;&#x800C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8BA1;&#x7B97;&#x5668;&#x4F5C;&#x4E3A;&#x8F85;&#x52A9;&#x5DE5;&#x5177;&#x6765;&#x8BA1;&#x7B97;&#x5927;&#x5C0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x73B0;&#x5728;&#x666E;&#x904D;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x7ED9;&#x9875;&#x9762;&#x7684;&#x5B57;&#x4F53;&#x8BBE;&#x7F6E;&#x5168;&#x5C40;&#x5C3A;&#x5BF8;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x76F8;&#x5BF9;&#x5355;&#x4F4D;&#x6765;&#x5B9A;&#x4E49;&#x9875;&#x9762;&#x4E2D;&#x5176;&#x5B83;&#x7684;&#x5143;&#x7D20;&#x3002;CSS&#x5927;&#x6982;&#x4F1A;&#x8FD9;&#x6837;&#x5199;&#xFF1A;<br>html { font-size: 10px; } p { font-size: 1.4em; }</p>
<p>&#x3000;&#x3000;&#x8FD9;&#x6837;&#x5199;&#x662F;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x6807;&#x7B7E;&#x5F53;&#x4E2D;&#xFF1A;<br>The cat sat on the mat.</p>
<p>&#x3000;&#x3000;&#x5982;&#x679C;&#x4F60;&#x8981;&#x8BBE;&#x7F6E;span&#x7684;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x4E3A;1.2em&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;&#x62FF;&#x51FA;&#x8BA1;&#x7B97;&#x5668;&#xFF0C;&#x7B97;&#x7B97;1.2&#x9664;&#x4EE5;1.4&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;<br>p span { font-size: 0.85714em; }</p>
<p>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0D;&#x5C40;&#x9650;&#x4E8E;em&#x3002;&#x5982;&#x679C;&#x7528;&#x767E;&#x5206;&#x6BD4;&#x6765;&#x521B;&#x5EFA;&#x54CD;&#x5E94;&#x5F0F;&#x7684;&#x6D41;&#x5F0F;&#x5E03;&#x5C40;&#x7F51;&#x7AD9;&#xFF0C;&#x800C;&#x767E;&#x5206;&#x6BD4;&#x662F;&#x4E0E;&#x5BB9;&#x5668;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4E3A;&#x5B83;&#x7684;&#x5BB9;&#x5668;&#x7684;40%&#xFF0C;&#x5B83;&#x7684;&#x9AD8;&#x662F;75%&#xFF0C;&#x5BBD;&#x5219;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E3A;53.33333%&#x3002;<br>&#x3000;&#x3000;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x8FD9;&#x5F88;&#x4E0D;&#x65B9;&#x4FBF;&#x3002;<br>&#x6839;&#x76F8;&#x5173;&#x7684;&#x957F;&#x5EA6;&#x5355;&#x4F4D;<br>&#x3000;&#x3000;&#x4E3A;&#x4E86;&#x4FEE;&#x590D;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x5B9A;&#x4E49;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5355;&#x4F4D;rem&#xFF08;root em&#xFF09;&#x3002;rem&#x540C;&#x6837;&#x662F;&#x76F8;&#x5BF9;&#x5355;&#x4F4D;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x57FA;&#x672C;&#x503C;&#xFF0C;&#x8FD9;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x57FA;&#x672C;&#x503C;&#x4E5F;&#x5C31;&#x662F;&#x6587;&#x6863;&#x7684;&#x6839;&#x5143;&#x7D20;&#x7684;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#xFF08;&#x5728;HTML&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5C31;&#x662F;html&#x5143;&#x7D20;&#xFF09;&#x3002;&#x5047;&#x8BBE;&#x548C;&#x4E0A;&#x4E2A;&#x4F8B;&#x5B50;&#x4E00;&#x6837;&#xFF0C;&#x540C;&#x6837;&#x8BBE;&#x5B9A;10px&#x7684;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x4E3A;&#x6839;&#x5143;&#x7D20;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x90A3;&#x4E48;CSS&#x8FD9;&#x6837;&#x5199;&#x5C31;OK&#x4E86;&#xFF1A;<br>p { font-size: 1.4rem; } p span { font-size: 1.2rem; }</p>
<p>&#x3000;&#x3000;&#x8FD9;&#x4E24;&#x4E2A;CSS&#x89C4;&#x5219;&#x90FD;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x6839;&#x5143;&#x7D20;&#x7684;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x4F18;&#x96C5;&#x548C;&#x7B80;&#x4FBF;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x8BBE;&#x7F6E;&#x7B80;&#x5355;&#x7684;&#x6570;&#x503C;&#x5982;10px&#x6216;&#x8005;12px&#x7684;&#x65F6;&#x5019;&#x3002;&#x8FD9;&#x6837;&#x548C;&#x4F7F;&#x7528;px&#x503C;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x4E0D;&#x540C;&#x70B9;&#x5728;&#x4E8E;rem&#x662F;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x6574;&#x7BC7;&#x6587;&#x7AE0;&#x4ECB;&#x7ECD;&#x7684;&#x7279;&#x6027;&#x4E2D;&#xFF0C;rem&#x7279;&#x6027;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x662F;&#x517C;&#x5BB9;&#x6027;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x9AD8;&#x7EA7;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x80FD;&#x652F;&#x6301;&#xFF0C;&#x5305;&#x62EC;IE9&#x5728;&#x5185;&#xFF0C;&#x9664;&#x4E86;Opera Mobile&#x3002;<br>&#x7A97;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x957F;&#x5EA6;&#x5355;&#x4F4D;<br>&#x3000;&#x3000;&#x89C9;&#x5F97;rem&#x5355;&#x4F4D;&#x5F88;&#x9177;&#x5427;&#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x7EC4;&#x5355;&#x4F4D;&#x80FD;&#x89E3;&#x51B3;&#x767E;&#x5206;&#x6BD4;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x5C31;&#x66F4;&#x9177;&#x4E86;&#x3002;&#x5B83;&#x548C;rem&#x7684;&#x9053;&#x7406;&#x76F8;&#x4F3C;&#xFF0C;&#x4E0D;&#x540C;&#x70B9;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x76F8;&#x5BF9;&#x7684;&#x4E0D;&#x662F;&#x6587;&#x6863;&#x7684;&#x6839;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x8BBE;&#x5907;&#x7A97;&#x53E3;&#x672C;&#x8EAB;&#x7684;&#x5927;&#x5C0F;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x4E24;&#x4E2A;&#x5355;&#x4F4D;&#x5C31;&#x662F;vh&#x548C;vw&#xFF0C;&#x5373;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x7684;&#x9AD8;&#x548C;&#x5BBD;&#x3002;&#x6BCF;&#x4E2A;&#x5355;&#x4F4D;&#x5728;&#x524D;&#x9762;&#x52A0;&#x4E0A;&#x6570;&#x5B57;&#xFF0C;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x591A;&#x5C11;&#x4E2A;&#x767E;&#x5206;&#x6BD4;&#x3002;<br>div { height: 50vh; }</p>
<p>&#x3000;&#x3000;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x9AD8;&#x5EA6;&#x88AB;&#x8BBE;&#x5B9A;&#x4E3A;&#x7A97;&#x53E3;&#x9AD8;&#x5EA6;&#x7684;&#x4E00;&#x534A;&#x3002;1vh&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x767E;&#x5206;&#x6BD4;&#x7684;&#x7A97;&#x53E3;&#x9AD8;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;50vh&#x5373;&#x662F;50%&#x7684;&#x7A97;&#x53E3;&#x9AD8;&#x5EA6;&#x3002;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x53D8;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x503C;&#x4E5F;&#x968F;&#x4E4B;&#x6539;&#x53D8;&#x3002;&#x8FD9;&#x76F8;&#x5BF9;&#x767E;&#x5206;&#x6BD4;&#x6765;&#x8BF4;&#xFF0C;&#x597D;&#x5904;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#x7236;&#x5BB9;&#x5668;&#xFF0C;&#x4E0D;&#x7BA1;&#x5B83;&#x7684;&#x7236;&#x5BB9;&#x5668;&#x5982;&#x4F55;&#xFF0C;10vw&#x7684;&#x5143;&#x7D20;&#x4F1A;&#x4E00;&#x76F4;&#x662F;10%&#x7684;&#x7A97;&#x53E3;&#x5927;&#x5C0F;&#x3002;<br>&#x3000;&#x3000;&#x76F8;&#x5E94;&#x5730;&#xFF0C;&#x6709;vmin&#x5355;&#x4F4D;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;vh&#x6216;&#x8005;vw&#x7684;&#x6700;&#x5C0F;&#x503C;&#xFF0C;&#x6700;&#x8FD1;&#x8FD8;&#x5BA3;&#x5E03;&#x6709;vmax&#x5355;&#x4F4D;&#x4F1A;&#x88AB;&#x52A0;&#x5230;&#x89C4;&#x8303;&#x6587;&#x6863;&#x91CC;&#x9762;&#xFF08;&#x867D;&#x7136;&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x53D1;&#x5E03;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x6CA1;&#x6709;&#xFF09;&#x3002;<br>&#x3000;&#x3000;&#x73B0;&#x5728;&#x652F;&#x6301;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x7684;&#x6709;IE9+&#x3001;Chrome&#x548C;Safari 6&#x3002;<br>&#x8FD0;&#x7B97;&#x5F0F;&#x7684;&#x503C;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x4F60;&#x5728;&#x505A;&#x54CD;&#x5E94;&#x5F0F;&#x7684;&#x6D41;&#x5F0F;&#x5E03;&#x5C40;&#x7F51;&#x7AD9;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x9047;&#x5230;&#x6DF7;&#x5408;&#x5355;&#x4F4D;&#x7684;&#x95EE;&#x9898;&#x2014;&#x2014;&#x7528;&#x767E;&#x5206;&#x6BD4;&#x8BBE;&#x7F6E;&#x6805;&#x683C;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x7528;&#x56FA;&#x5B9A;&#x50CF;&#x7D20;&#x5BBD;&#x5EA6;&#x8BBE;&#x7F6E;margin&#x3002;&#x5982;&#xFF1A;<br>div { margin: 0 20px; width: 33%;}</p>
<p>&#x3000;&#x3000;&#x5982;&#x679C;&#x5E03;&#x5C40;&#x53EA;&#x7528;&#x5230;padding&#x548C;border&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;box-sizing&#x6765;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;margin&#x5C31;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#x4E86;&#x3002;&#x66F4;&#x597D;&#x3001;&#x66F4;&#x7075;&#x6D3B;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;calc()&#x51FD;&#x6570;&#xFF0C;&#x8BBE;&#x7F6E;&#x4E0D;&#x540C;&#x5355;&#x4F4D;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x5B66;&#x65B9;&#x7A0B;&#x5F0F;&#xFF0C;&#x5982;&#xFF1A;<br>div { margin: 0 20px; width: calc(33% - 40px);}</p>
<p>&#x3000;&#x3000;&#x5B83;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8BA1;&#x7B97;&#x5BBD;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8BA1;&#x7B97;&#x957F;&#x5EA6;&#x2014;&#x2014;&#x5982;&#x679C;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;calc()&#x91CC;&#x9762;&#x518D;&#x52A0;calc()&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x7279;&#x6027;IE9+&#x548C;Firefox&#x90FD;&#x652F;&#x6301;&#xFF0C;Firefox&#x9700;&#x8981;&#x52A0;&#x4E0A; -moz- &#x524D;&#x7F00;&#xFF08;&#x5728;&#x7248;&#x672C;16&#x6216;17&#x53EF;&#x80FD;&#x4E0D;&#x7528;&#x52A0;&#x524D;&#x7F00;&#xFF09;&#xFF0C;Chrome&#x548C;Safari&#x4E5F;&#x652F;&#x6301;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x52A0;&#x4E0A; -webkit- &#x524D;&#x7F00;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x79FB;&#x52A8;Webkit&#x8FD8;&#x4E0D;&#x652F;&#x6301;&#x3002;<br>&#x52A0;&#x8F7D;&#x5B57;&#x4F53;&#x5E93;&#x7684;&#x90E8;&#x5206;&#x5B57;&#x4F53;<br>&#x3000;&#x3000;&#x4F18;&#x8D8A;&#x7684;&#x6027;&#x80FD;&#x5F80;&#x5F80;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5E02;&#x573A;&#x4E0A;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x2014;&#x2014;&#x5BFC;&#x81F4;&#x8FDE;&#x63A5;&#x901F;&#x5EA6;&#x7684;&#x5DEE;&#x5F02;&#x548C;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x2014;&#x2014;&#x66F4;&#x52A0;&#x4F53;&#x73B0;&#x4E86;&#x8FD9;&#x4E2A;&#x91CD;&#x8981;&#x6027;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x52A0;&#x5FEB;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x51CF;&#x5C11;&#x5916;&#x90E8;&#x6587;&#x4EF6;&#x4E2A;&#x6570;&#xFF0C;@font-face&#x7684;&#x4E00;&#x4E2A;&#x65B0;&#x5C5E;&#x6027;unicode-range&#x5C31;&#x662F;&#x4E3A;&#x6B64;&#x800C;&#x751F;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x5C31;&#x662F;unicode-range&#xFF08;&#x7F16;&#x7801;&#x8303;&#x56F4;&#xFF09;&#xFF0C;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x7F16;&#x7801;&#x5B57;&#x4F53;&#x7684;&#x53C2;&#x6570;&#x8303;&#x56F4;&#x3002;&#x5728;&#x52A0;&#x8F7D;&#x5916;&#x90E8;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x6709;&#x90A3;&#x4E9B;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x5B57;&#x4F53;&#x624D;&#x4F1A;&#x88AB;&#x52A0;&#x8F7D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6574;&#x5957;&#x5B57;&#x4F53;&#x5E93;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6F14;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4ECE;foo.ttf&#x5B57;&#x4F53;&#x5E93;&#x4E2D;&#x4EC5;&#x52A0;&#x8F7D;&#x4E09;&#x4E2A;&#x5B57;&#x4F53;&#xFF1A;<br>@font-face {font-family: foo;src: url(&#x2018;foo.ttf&#x2019;);unicode-range: U+31-33;}</p>
<p>&#x3000;&#x3000;&#x8FD9;&#x70B9;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;&#x5B57;&#x4F53;&#x56FE;&#x6807;&#x7684;&#x9875;&#x9762;&#x5C24;&#x5176;&#x6709;&#x7528;&#x3002;&#x6211;&#x6D4B;&#x8BD5;&#x8FC7;&#xFF0C;&#x4F7F;&#x7528;unicode-range&#xFF0C;&#x52A0;&#x8F7D;&#x5B57;&#x4F53;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x95F4;&#x5E73;&#x5747;&#x51CF;&#x5C11;&#x4E86;0.85&#x79D2;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x5C0F;&#x6570;&#x76EE;&#x4E86;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x60F3;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x76EE;&#x524D;&#x53EF;&#x4EE5;&#x5728;IE9+&#x3001;Webkit&#x6D4F;&#x89C8;&#x5668;&#xFF08;&#x5982;Chrome&#x548C;Safari&#xFF09;&#x4E2D;&#x8FD0;&#x884C;&#x3002;<br>&#x65B0;&#x7684;&#x4F2A;&#x7C7B;<br>&#x3000;&#x3000;&#x5355;&#x4F4D;&#x548C;&#x503C;&#x90FD;&#x5E94;&#x8BE5;&#x597D;&#x597D;&#x5229;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x8BA9;&#x6211;&#x66F4;&#x5174;&#x594B;&#x7684;&#x662F;&#x9009;&#x62E9;&#x5668;&#x548C;&#x4F2A;&#x7C7B;&#x3002;&#x5B8C;&#x5584;&#x7684;&#x9009;&#x62E9;&#x5668;&#x6A21;&#x5F0F;&#xFF0C;&#x5373;&#x4F7F;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#xFF0C;&#x90FD;&#x8BA9;&#x6211;&#x5174;&#x594B;&#x4E0D;&#x5DF2;&#x3002;&#x5F15;&#x7528;&#x4E54;&#x5E03;&#x65AF;&#x7684;&#x8BDD;&#xFF1A;&#x4F60;&#x8981;&#x628A;&#x6805;&#x680F;&#x7684;&#x91CC;&#x9762;&#x4FEE;&#x5F97;&#x548C;&#x5916;&#x9762;&#x4E00;&#x6837;&#x6F02;&#x4EAE;&#xFF0C;&#x5373;&#x4F7F;&#x522B;&#x4EBA;&#x770B;&#x4E0D;&#x5230;&#x91CC;&#x9762;&#x2014;&#x2014;&#x56E0;&#x4E3A;&#x4F60;&#x81EA;&#x5DF1;&#x77E5;&#x9053;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;:nth-of-type()&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7B80;&#x76F4;&#x662F;&#x4E00;&#x6B21;&#x7A81;&#x7834;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x51B2;&#x51FA;&#x4E86;&#x601D;&#x60F3;&#x7684;&#x684E;&#x688F;&#x3002;&#x597D;&#x5427;&#xFF0C;&#x6211;&#x6709;&#x4E9B;&#x5938;&#x5F20;&#x4E86;&#x3002;&#x4F46;&#x6709;&#x4E9B;&#x65B0;&#x7684;CSS&#x4F2A;&#x7C7B;&#xFF0C;&#x786E;&#x5B9E;&#x503C;&#x5F97;&#x72C2;&#x70ED;&#x4E00;&#x756A;&#x3002;<br>&#x5426;&#x5B9A;&#x4F2A;&#x7C7B;<br>&#x3000;&#x3000;&#x4F60;&#x5927;&#x6982;&#x4E0D;&#x77E5;&#x9053; :not() &#x4F2A;&#x7C7B;&#x7684;&#x597D;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x4EB2;&#x81EA;&#x5B9E;&#x8DF5;&#x4E00;&#x756A;&#x3002;&#x5E26;&#x6709;&#x53C2;&#x6570;&#x7684; :not() &#x5176;&#x5B9E;&#x5C31;&#x662F;&#x666E;&#x901A;&#x7684;&#x9009;&#x62E9;&#x5668;&#x2014;&#x2014;&#x4E0D;&#x662F;&#x590D;&#x5408;&#x9009;&#x62E9;&#x5668;&#x3002;&#x4E00;&#x7EC4;&#x5143;&#x7D20;&#x52A0;&#x4E0A;&#x9009;&#x62E9;&#x5668; :not()&#xFF0C;&#x8868;&#x793A;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x5143;&#x7D20;&#x4F1A;&#x88AB;&#x6392;&#x9664;&#x51FA;&#x53BB;&#x3002;&#x542C;&#x8D77;&#x6765;&#x6709;&#x4E9B;&#x590D;&#x6742;&#x5427;&#xFF1F;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;<br>&#x3000;&#x3000;&#x5047;&#x8BBE;&#xFF1A;&#x8981;&#x5BF9;&#x9879;&#x76EE;&#x5217;&#x8868;&#x7684;&#x5947;&#x6570;&#x884C;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x540E;&#x4E00;&#x884C;&#x9664;&#x5916;&#x3002;&#x5982;&#x679C;&#x662F;&#x4EE5;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x8FD9;&#x6837;&#x5199;&#xFF1A;<br>li { color: #00F; } li:nth-child(odd) { color: #F00; } li:last-child { color: #00F; }</p>
<p>&#x3000;&#x3000;&#x73B0;&#x5728;&#xFF0C;&#x901A;&#x8FC7;&#x8BBE;&#x5B9A;:last-child&#x4F5C;&#x4E3A;&#x5426;&#x5B9A;&#x4F2A;&#x7C7B;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x6392;&#x9664;&#xFF0C;&#x8FD9;&#x6837;&#x5C11;&#x4E86;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4ECE;&#x800C;&#x66F4;&#x52A0;&#x7684;&#x7B80;&#x6D01;&#x548C;&#x6613;&#x7EF4;&#x62A4;&#x3002;<br>li { color: #00F; } li:nth-child(odd):not(:last-child) { color: #F00; }</p>
<p>&#x3000;&#x3000;&#x5426;&#x5B9A;&#x4F2A;&#x7C7B;&#x770B;&#x8D77;&#x6765;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x60CA;&#x4EBA;&#x4E4B;&#x5904;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x5B83;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x8FD8;&#x662F;&#x633A;&#x5B9E;&#x7528;&#x7684;&#x3002;&#x6211;&#x66FE;&#x7ECF;&#x628A;&#x5B83;&#x7528;&#x5728;&#x57FA;&#x4E8E;Webkit&#x7684;&#x9879;&#x76EE;&#x5F53;&#x4E2D;&#xFF0C;&#x4F18;&#x52BF;&#x8FD8;&#x662F;&#x633A;&#x660E;&#x663E;&#x7684;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x5B83;&#x662F;&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x4F2A;&#x7C7B;&#x4E4B;&#x4E00;&#x3002;<br>&#x3000;&#x3000;&#x662F;&#x7684;&#xFF0C;&#x6211;&#x6709;&#x6700;&#x559C;&#x6B22;&#x7684;&#x4F2A;&#x7C7B;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x672C;&#x6587;&#x63D0;&#x5230;&#x7684;&#x7279;&#x6027;&#x5F53;&#x4E2D;&#xFF0C;&#x5426;&#x5B9A;&#x4F2A;&#x7C7B;&#x662F;&#x517C;&#x5BB9;&#x6027;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x5B83;&#x88AB;IE9+&#x548C;&#x9AD8;&#x7EA7;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#xFF08;&#x4E0D;&#x9700;&#x8981;&#x52A0;&#x6D4F;&#x89C8;&#x5668;&#x4EA7;&#x5546;&#x524D;&#x7F00;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x719F;&#x6089;jQuery&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4E60;&#x60EF;&#x7528;&#x5B83;&#x2014;&#x2014;&#x7248;&#x672C;1.0&#x5F00;&#x59CB;&#x5C31;&#x6709;&#x4E86;&#xFF0C;&#x4EE5;&#x53CA;&#x76F8;&#x4F3C;&#x7684;not()&#x65B9;&#x6CD5;&#x3002;<br>&#x201C;&#x9002;&#x7528;&#x4E8E;&#x201D;&#x4F2A;&#x7C7B;<br>&#x3000;&#x3000;:matches() &#x4F2A;&#x7C7B;&#x53EF;&#x4EE5;&#x7528;&#x666E;&#x901A;&#x7684;&#x9009;&#x62E9;&#x5668;&#x3001;&#x590D;&#x5408;&#x9009;&#x62E9;&#x5668;&#x3001;&#x9017;&#x53F7;&#x9694;&#x5F00;&#x7684;&#x5217;&#x8868;&#x6216;&#x4EFB;&#x4F55;&#x7684;&#x9009;&#x62E9;&#x5668;&#x7EC4;&#x5408;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;&#x592A;&#x68D2;&#x4E86;&#xFF01;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x80FD;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;<br>&#x3000;&#x3000;:matches() &#x4F2A;&#x7C7B;&#x6700;&#x5F3A;&#x5927;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x662F;&#x805A;&#x5408;&#x591A;&#x884C;&#x9009;&#x62E9;&#x5668;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8981;&#x9009;&#x62E9;&#x7236;&#x5BB9;&#x5668;&#x91CC;&#x9762;&#x5176;&#x4E2D;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x5B50;&#x5BB9;&#x5668;&#x91CC;&#x9762;&#x7684;p&#x5143;&#x7D20;&#xFF0C;&#x5728;&#x8FD9;&#x4E4B;&#x524D;&#xFF0C;&#x4EE3;&#x7801;&#x6216;&#x8BB8;&#x4F1A;&#x5199;&#x6210;&#x8FD9;&#x6837;&#xFF1A;<br>.home header p,.home footer p,.home aside p {color: #F00;}</p>
<p>&#x3000;&#x3000;&#x6709;&#x4E86;:matches()&#x4F2A;&#x7C7B;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x5171;&#x540C;&#x70B9;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x7F29;&#x51CF;&#x4EE3;&#x7801;&#x91CF;&#x3002;&#x8BE5;&#x4F8B;&#x5B50;&#x91CC;&#x9762;&#xFF0C;&#x9009;&#x62E9;&#x5668;&#x7684;&#x5171;&#x540C;&#x70B9;&#x662F;&#x4EE5;home&#x4E3A;&#x8D77;&#x70B9;&#x3001;&#x4EE5;p&#x4E3A;&#x7EC8;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x7528;:matches()&#x628A;&#x4E2D;&#x95F4;&#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x96C6;&#x5408;&#x8D77;&#x6765;&#x3002;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x4E9B;&#x56F0;&#x60D1;&#xFF1F;&#x770B;&#x770B;&#x4EE3;&#x7801;&#x5C31;&#x660E;&#x767D;&#x4E86;&#xFF1A;<br>.home :matches(header,footer,aside) p { color: #F00; }</p>
<p>&#x3000;&#x3000;&#x8FD9;&#x5176;&#x5B9E;&#x662F;CSS4&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF08;&#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;&#x662F;CSS&#x9009;&#x62E9;&#x5668;&#x7B2C;&#x56DB;&#x7B49;&#x7EA7;&#xFF09;&#xFF0C;&#x8FD9;&#x4EFD;&#x89C4;&#x8303;&#x6587;&#x6863;&#x8FD8;&#x63D0;&#x5230;&#x5C06;&#x4F1A;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x8BED;&#x6CD5;&#xFF08;&#x4EE5;&#x9017;&#x53F7;&#x9694;&#x5F00;&#x7684;&#x590D;&#x5408;&#x9009;&#x62E9;&#x5668;&#xFF09;&#x5E94;&#x7528;&#x4E8E;:not()&#x4F2A;&#x7C7B;&#x3002;&#x5174;&#x594B;ing&#xFF01;<br>&#x3000;&#x3000;&#x76EE;&#x524D;&#xFF0C;:matches()&#x53EF;&#x4EE5;&#x5728;Chrome&#x548C;Safari&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x52A0;&#x4E0A;&#x524D;&#x7F00;-webkit-&#xFF0C;Firefox&#x4E5F;&#x652F;&#x6301;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6309;&#x7167;&#x65E7;&#x7684;&#x5199;&#x6CD5;:any()&#xFF0C;&#x540C;&#x65F6;&#x8981;&#x52A0;&#x4E0A;-moz-&#x524D;&#x7F00;&#x3002;<br>&#x4F60;&#x7231;&#x4E0A;&#x8FD9;&#x4E9B;&#x6734;&#x5B9E;&#x7684;CSS&#x7EC6;&#x8282;&#x4E86;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x8BB2;&#x5230;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x6700;&#x8D5E;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x5B83;&#x4EEC;&#x89E3;&#x51B3;&#x4E86;&#x73B0;&#x5B9E;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4ECE;&#x7410;&#x788E;&#x800C;&#x7E41;&#x590D;&#x7684;&#x9009;&#x62E9;&#x5668;&#x5230;&#x5EFA;&#x7ACB;&#x54CD;&#x5E94;&#x5F0F;&#x7F51;&#x7AD9;&#x7684;&#x65B0;&#x6311;&#x6218;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x671F;&#x5F85;&#x6BCF;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#x88AB;&#x4F7F;&#x7528;&#x5230;&#x6700;&#x666E;&#x901A;&#x7684;&#x9879;&#x76EE;&#x5F53;&#x4E2D;&#x3002;&#xFF08;web&#x524D;&#x7AEF;&#x5B66;&#x4E60;&#x4EA4;&#x6D41;&#x7FA4;&#xFF1A;328058344 &#x7981;&#x6B62;&#x95F2;&#x804A;&#xFF0C;&#x975E;&#x559C;&#x52FF;&#x8FDB;&#xFF01;&#xFF09;</p>
<p>&#x3000;&#x3000;&#x65B0;&#x7279;&#x6027;&#x5982;&#x6EE4;&#x955C;&#x53EF;&#x80FD;&#x5F88;&#x76F4;&#x89C2;&#x5F88;&#x534E;&#x4E3D;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x66F4;&#x613F;&#x610F;&#x53D1;&#x73B0;&#x9690;&#x85CF;&#x5728;&#x6DF1;&#x5904;&#x7684;&#x5B9E;&#x7528;&#x5C0F;&#x6280;&#x5DE7;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x79EF;&#x6781;&#x63A2;&#x7D22;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x7684;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x66F4;&#x987A;&#x5229;&#x2014;&#x2014;&#x60F3;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x89C9;&#x5F97;&#x7E41;&#x7410;&#x4E86;ted below are all the plug</p>
<h2 id="CSS&#x76F8;&#x5173;"><a href="#CSS&#x76F8;&#x5173;" class="headerlink" title="CSS&#x76F8;&#x5173;"></a>CSS&#x76F8;&#x5173;</h2><p>1&#x3001;&#x5DE6;&#x8FB9;&#x5B9A;&#x5BBD;&#xFF0C;&#x53F3;&#x8FB9;&#x81EA;&#x9002;&#x5E94;&#x65B9;&#x6848;&#xFF1A;float + margin&#xFF0C;float + calc</p>
<p>/* &#x65B9;&#x6848;1 <em>/<br>.left {<br>    width: 120px;<br>    float: left;<br>}<br>.right {<br>    margin-left: 120px;<br>}<br>/</em> &#x65B9;&#x6848;2 */<br>.left {<br>    width: 120px;<br>    float: left;<br>}<br>.right {<br>    width: calc(100% - 120px);<br>    float: left;<br>}<br>2&#x3001;&#x5DE6;&#x53F3;&#x4E24;&#x8FB9;&#x5B9A;&#x5BBD;&#xFF0C;&#x4E2D;&#x95F4;&#x81EA;&#x9002;&#x5E94;&#xFF1A;float&#xFF0C;float + calc, &#x5723;&#x676F;&#x5E03;&#x5C40;&#xFF08;&#x8BBE;&#x7F6E;BFC&#xFF0C;margin&#x8D1F;&#x503C;&#x6CD5;&#xFF09;&#xFF0C;flex</p>
<p>.wrap {<br>    width: 100%;<br>    height: 200px;<br>}<br>.wrap &gt; div {<br>    height: 100%;<br>}<br>/* &#x65B9;&#x6848;1 <em>/<br>.left {<br>    width: 120px;<br>    float: left;<br>}<br>.right {<br>    float: right;<br>    width: 120px;<br>}<br>.center {<br>    margin: 0 120px;<br>}<br>/</em> &#x65B9;&#x6848;2 <em>/<br>.left {<br>    width: 120px;<br>    float: left;<br>}<br>.right {<br>  float: right;<br>  width: 120px;<br>}<br>.center {<br>       width: calc(100% - 240px);<br>       margin-left: 120px;<br>}<br>/</em> &#x65B9;&#x6848;3 */<br>.wrap {<br>    display: flex;<br>}<br>.left {<br>    width: 120px;<br>}<br>.right {<br>    width: 120px;<br>}<br>.center {<br>    flex: 1;<br>}<br>3&#x3001;&#x5DE6;&#x53F3;&#x5C45;&#x4E2D;</p>
<p>&#x884C;&#x5185;&#x5143;&#x7D20;: text-align: center<br>&#x5B9A;&#x5BBD;&#x5757;&#x72B6;&#x5143;&#x7D20;: &#x5DE6;&#x53F3; margin &#x503C;&#x4E3A; auto<br>&#x4E0D;&#x5B9A;&#x5BBD;&#x5757;&#x72B6;&#x5143;&#x7D20;: table&#x5E03;&#x5C40;&#xFF0C;position + transform<br>/* &#x65B9;&#x6848;1 <em>/<br>.wrap {<br>    text-align: center<br>}<br>.center {<br>     display: inline;<br>         /</em> or <em>/<br>         /</em> display: inline-block; <em>/<br>}<br>/</em> &#x65B9;&#x6848;2 <em>/<br>.center {<br>    width: 100px;<br>    margin: 0 auto;<br>}<br>/</em> &#x65B9;&#x6848;2 */<br>.wrap {<br>    position: relative;<br>}<br>.center {<br>position: absulote;<br>    left: 50%;<br>    transform: translateX(-50%);<br>}<br>4&#x3001;&#x4E0A;&#x4E0B;&#x5782;&#x76F4;&#x5C45;&#x4E2D;&#xFF1A;</p>
<p>&#x5B9A;&#x9AD8;&#xFF1A;margin&#xFF0C;position + margin(&#x8D1F;&#x503C;)<br>    &#x4E0D;&#x5B9A;&#x9AD8;&#xFF1A;position + transform&#xFF0C;flex&#xFF0C;IFC + vertical-align:middle<br>    /* &#x5B9A;&#x9AD8;&#x65B9;&#x6848;1 <em>/<br>.center {<br>    height: 100px;<br>    margin: 50px 0;<br>    }<br>/</em> &#x5B9A;&#x9AD8;&#x65B9;&#x6848;2 <em>/<br>.center {<br>    height: 100px;<br>    position: absolute;<br>    top: 50%;<br>    margin-top: -25px;<br>}<br>/</em> &#x4E0D;&#x5B9A;&#x9AD8;&#x65B9;&#x6848;1 <em>/<br>.center {<br>    position: absolute;<br>    top: 50%;<br>    transform: translateY(-50%);<br>}<br>/</em> &#x4E0D;&#x5B9A;&#x9AD8;&#x65B9;&#x6848;2 <em>/<br>.wrap {<br>     display: flex;<br>     align-items: center;<br>}<br>.center {<br>width: 100%;<br>}<br>/</em> &#x4E0D;&#x5B9A;&#x9AD8;&#x65B9;&#x6848;3 <em>/<br>/</em> &#x8BBE;&#x7F6E; inline-block &#x5219;&#x4F1A;&#x5728;&#x5916;&#x5C42;&#x4EA7;&#x751F; IFC&#xFF0C;&#x9AD8;&#x5EA6;&#x8BBE;&#x4E3A; 100% &#x6491;&#x5F00; wrap &#x7684;&#x9AD8;&#x5EA6; */<br>.wrap::before {<br>content: &#x2018;&#x2019;;<br>height: 100%;<br>display: inline-block;<br>         vertical-align: middle;<br>}<br>.wrap {<br>    text-align: center;<br>}<br>.center {<br>display: inline-block;<br>         vertical-align: middle;<br>}<br>5&#x3001;&#x76D2;&#x6A21;&#x578B;&#xFF1A;content&#xFF08;&#x5143;&#x7D20;&#x5185;&#x5BB9;&#xFF09; + padding&#xFF08;&#x5185;&#x8FB9;&#x8DDD;&#xFF09; + border&#xFF08;&#x8FB9;&#x6846;&#xFF09; + margin&#xFF08;&#x5916;&#x8FB9;&#x8DDD;&#xFF09;</p>
<p>&#x5EF6;&#x4F38;&#xFF1A; box-sizing</p>
<p>content-box&#xFF1A;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x603B;&#x5BBD;&#x5EA6; = margin + border + padding + width<br>border-box&#xFF1A;&#x76D2;&#x5B50;&#x5BBD;&#x5EA6;&#x5305;&#x542B; padding &#x548C; border&#xFF0C;&#x603B;&#x5BBD;&#x5EA6; = margin + width<br>inherit&#xFF1A;&#x4ECE;&#x7236;&#x5143;&#x7D20;&#x7EE7;&#x627F; box-sizing &#x5C5E;&#x6027;<br>6&#x3001;BFC&#x3001;IFC&#x3001;GFC&#x3001;FFC&#xFF1A;FC&#xFF08;Formatting Contexts&#xFF09;&#xFF0C;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;</p>
<p>BFC&#xFF1A;&#x5757;&#x7EA7;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x5BB9;&#x5668;&#x91CC;&#x9762;&#x7684;&#x5B50;&#x5143;&#x7D20;&#x4E0D;&#x4F1A;&#x5728;&#x5E03;&#x5C40;&#x4E0A;&#x5F71;&#x54CD;&#x5230;&#x5916;&#x9762;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x53CD;&#x4E4B;&#x4E5F;&#x662F;&#x5982;&#x6B64;(&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x7406;&#x5FF5;&#x6765;&#x60F3;&#xFF0C;&#x53EA;&#x8981;&#x8131;&#x79BB;&#x6587;&#x6863;&#x6D41;&#xFF0C;&#x80AF;&#x5B9A;&#x5C31;&#x80FD;&#x4EA7;&#x751F; BFC)&#x3002;&#x4EA7;&#x751F; BFC &#x65B9;&#x5F0F;&#x5982;&#x4E0B;<br>float &#x7684;&#x503C;&#x4E0D;&#x4E3A; none&#x3002;<br>overflow &#x7684;&#x503C;&#x4E0D;&#x4E3A; visible&#x3002;<br>position &#x7684;&#x503C;&#x4E0D;&#x4E3A; relative &#x548C; static&#x3002;<br>display &#x7684;&#x503C;&#x4E3A; table-cell, table-caption, inline-block&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x3002;<br>&#x7528;&#x5904;&#xFF1F;&#x5E38;&#x89C1;&#x7684;&#x591A;&#x680F;&#x5E03;&#x5C40;&#xFF0C;&#x7ED3;&#x5408;&#x5757;&#x7EA7;&#x522B;&#x5143;&#x7D20;&#x6D6E;&#x52A8;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x5143;&#x7D20;&#x5219;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x9694;&#x79BB;&#x7684;&#x73AF;&#x5883;&#x91CC;&#x8FD0;&#x884C;&#x3002;</p>
<p>IFC&#xFF1A;&#x5185;&#x8054;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;IFC &#x7684; line box&#xFF08;&#x7EBF;&#x6846;&#xFF09;&#x9AD8;&#x5EA6;&#x7531;&#x5176;&#x5305;&#x542B;&#x884C;&#x5185;&#x5143;&#x7D20;&#x4E2D;&#x6700;&#x9AD8;&#x7684;&#x5B9E;&#x9645;&#x9AD8;&#x5EA6;&#x8BA1;&#x7B97;&#x800C;&#x6765;&#xFF08;&#x4E0D;&#x53D7;&#x5230;&#x7AD6;&#x76F4;&#x65B9;&#x5411;&#x7684; padding/margin &#x5F71;&#x54CD;)&#x3002;<br>IFC&#x4E2D;&#x7684;line box&#x4E00;&#x822C;&#x5DE6;&#x53F3;&#x90FD;&#x8D34;&#x7D27;&#x6574;&#x4E2A; IFC&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x56E0;&#x4E3A; float &#x5143;&#x7D20;&#x800C;&#x6270;&#x4E71;&#x3002;float &#x5143;&#x7D20;&#x4F1A;&#x4F4D;&#x4E8E; IFC &#x4E0E; line box &#x4E4B;&#x95F4;&#xFF0C;&#x4F7F;&#x5F97; line box &#x5BBD;&#x5EA6;&#x7F29;&#x77ED;&#x3002; &#x540C;&#x4E2A; ifc &#x4E0B;&#x7684;&#x591A;&#x4E2A; line box &#x9AD8;&#x5EA6;&#x4F1A;&#x4E0D;&#x540C;&#x3002; IFC &#x4E2D;&#x65F6;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#x7684;&#xFF0C;&#x5F53;&#x63D2;&#x5165;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#x65F6;&#xFF08;&#x5982; p &#x4E2D;&#x63D2;&#x5165; div &#xFF09;&#x4F1A;&#x4EA7;&#x751F;&#x4E24;&#x4E2A;&#x533F;&#x540D;&#x5757;&#x4E0E; div &#x5206;&#x9694;&#x5F00;&#xFF0C;&#x5373;&#x4EA7;&#x751F;&#x4E24;&#x4E2A; IFC &#xFF0C;&#x6BCF;&#x4E2A; IFC &#x5BF9;&#x5916;&#x8868;&#x73B0;&#x4E3A;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#xFF0C;&#x4E0E; div &#x5782;&#x76F4;&#x6392;&#x5217;&#x3002;</p>
<p>&#x7528;&#x5904;&#xFF1F;</p>
<p>&#x6C34;&#x5E73;&#x5C45;&#x4E2D;&#xFF1A;&#x5F53;&#x4E00;&#x4E2A;&#x5757;&#x8981;&#x5728;&#x73AF;&#x5883;&#x4E2D;&#x6C34;&#x5E73;&#x5C45;&#x4E2D;&#x65F6;&#xFF0C;&#x8BBE;&#x7F6E;&#x5176;&#x4E3A; inline-block &#x5219;&#x4F1A;&#x5728;&#x5916;&#x5C42;&#x4EA7;&#x751F;IFC&#xFF0C;&#x901A;&#x8FC7; text-align &#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x5176;&#x6C34;&#x5E73;&#x5C45;&#x4E2D;&#x3002;<br>&#x5782;&#x76F4;&#x5C45;&#x4E2D;&#xFF1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; IFC&#xFF0C;&#x7528;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x6491;&#x5F00;&#x7236;&#x5143;&#x7D20;&#x7684;&#x9AD8;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x8BBE;&#x7F6E;&#x5176; vertical-align: middle&#xFF0C;&#x5176;&#x4ED6;&#x884C;&#x5185;&#x5143;&#x7D20;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x6B64;&#x7236;&#x5143;&#x7D20;&#x4E0B;&#x5782;&#x76F4;&#x5C45;&#x4E2D;</p>
<p>GFC&#xFF1A;&#x7F51;&#x683C;&#x5E03;&#x5C40;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF08;display: grid&#xFF09;<br>FFC&#xFF1A;&#x81EA;&#x9002;&#x5E94;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF08;display: flex&#xFF09;<br>CSS2.1&#x4E2D;&#x53EA;&#x6709;BFC&#x548C;IFC, CSS3&#x4E2D;&#x624D;&#x6709;GFC&#x548C;FFC&#x3002;<br>&#x5230;&#x5E95;&#x4EC0;&#x4E48;&#x662F;BFC&#x3001;IFC&#x3001;GFC&#x548C;FFC&#xFF0C;&#x6B21;&#x5965;</p>
<p>What&#x2019;s FC&#xFF1F;<br>&#x4E00;&#x5B9A;&#x4E0D;&#x662F;KFC&#xFF0C;FC&#x7684;&#x5168;&#x79F0;&#x662F;&#xFF1A;Formatting Contexts&#xFF0C;&#x662F;W3C CSS2.1&#x89C4;&#x8303;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x3002;&#x5B83;&#x662F;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x4E00;&#x5757;&#x6E32;&#x67D3;&#x533A;&#x57DF;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x4E00;&#x5957;&#x6E32;&#x67D3;&#x89C4;&#x5219;&#xFF0C;&#x5B83;&#x51B3;&#x5B9A;&#x4E86;&#x5176;&#x5B50;&#x5143;&#x7D20;&#x5C06;&#x5982;&#x4F55;&#x5B9A;&#x4F4D;&#xFF0C;&#x4EE5;&#x53CA;&#x548C;&#x5176;&#x4ED6;&#x5143;&#x7D20;&#x7684;&#x5173;&#x7CFB;&#x548C;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;<br>BFC<br>BFC(Block Formatting Contexts)&#x76F4;&#x8BD1;&#x4E3A;&#x201D;&#x5757;&#x7EA7;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#x201D;&#x3002;Block Formatting Contexts&#x5C31;&#x662F;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x9694;&#x79BB;&#x7684;&#x6E32;&#x67D3;&#x533A;&#x57DF;&#xFF0C;&#x5BB9;&#x5668;&#x91CC;&#x9762;&#x7684;&#x5B50;&#x5143;&#x7D20;&#x4E0D;&#x4F1A;&#x5728;&#x5E03;&#x5C40;&#x4E0A;&#x5F71;&#x54CD;&#x5230;&#x5916;&#x9762;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x53CD;&#x4E4B;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x5982;&#x4F55;&#x4EA7;&#x751F;BFC&#xFF1F;<br>float&#x7684;&#x503C;&#x4E0D;&#x4E3A;none&#x3002;<br>overflow&#x7684;&#x503C;&#x4E0D;&#x4E3A;visible&#x3002;<br>position&#x7684;&#x503C;&#x4E0D;&#x4E3A;relative&#x548C;static&#x3002;<br>display&#x7684;&#x503C;&#x4E3A;table-cell, table-caption, inline-block&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x3002;<br>&#x90A3;BFC&#x4E00;&#x822C;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#x5462;&#xFF1F;&#x6BD4;&#x5982;&#x5E38;&#x89C1;&#x7684;&#x591A;&#x680F;&#x5E03;&#x5C40;&#xFF0C;&#x7ED3;&#x5408;&#x5757;&#x7EA7;&#x522B;&#x5143;&#x7D20;&#x6D6E;&#x52A8;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x5143;&#x7D20;&#x5219;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x9694;&#x79BB;&#x7684;&#x73AF;&#x5883;&#x91CC;&#x8FD0;&#x884C;&#x3002;<br>IFC<br>IFC(Inline Formatting Contexts)&#x76F4;&#x8BD1;&#x4E3A;&#x201D;&#x5185;&#x8054;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#x201D;&#xFF0C;IFC&#x7684;line box&#xFF08;&#x7EBF;&#x6846;&#xFF09;&#x9AD8;&#x5EA6;&#x7531;&#x5176;&#x5305;&#x542B;&#x884C;&#x5185;&#x5143;&#x7D20;&#x4E2D;&#x6700;&#x9AD8;&#x7684;&#x5B9E;&#x9645;&#x9AD8;&#x5EA6;&#x8BA1;&#x7B97;&#x800C;&#x6765;&#xFF08;&#x4E0D;&#x53D7;&#x5230;&#x7AD6;&#x76F4;&#x65B9;&#x5411;&#x7684;padding/margin&#x5F71;&#x54CD;)<br>IFC&#x4E2D;&#x7684;line box&#x4E00;&#x822C;&#x5DE6;&#x53F3;&#x90FD;&#x8D34;&#x7D27;&#x6574;&#x4E2A;IFC&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x56E0;&#x4E3A;float&#x5143;&#x7D20;&#x800C;&#x6270;&#x4E71;&#x3002;float&#x5143;&#x7D20;&#x4F1A;&#x4F4D;&#x4E8E;IFC&#x4E0E;&#x4E0E;line box&#x4E4B;&#x95F4;&#xFF0C;&#x4F7F;&#x5F97;line box&#x5BBD;&#x5EA6;&#x7F29;&#x77ED;&#x3002; &#x540C;&#x4E2A;ifc&#x4E0B;&#x7684;&#x591A;&#x4E2A;line box&#x9AD8;&#x5EA6;&#x4F1A;&#x4E0D;&#x540C;&#x3002; IFC&#x4E2D;&#x65F6;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#x7684;&#xFF0C;&#x5F53;&#x63D2;&#x5165;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#x65F6;&#xFF08;&#x5982;p&#x4E2D;&#x63D2;&#x5165;div&#xFF09;&#x4F1A;&#x4EA7;&#x751F;&#x4E24;&#x4E2A;&#x533F;&#x540D;&#x5757;&#x4E0E;div&#x5206;&#x9694;&#x5F00;&#xFF0C;&#x5373;&#x4EA7;&#x751F;&#x4E24;&#x4E2A;IFC&#xFF0C;&#x6BCF;&#x4E2A;IFC&#x5BF9;&#x5916;&#x8868;&#x73B0;&#x4E3A;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#xFF0C;&#x4E0E;div&#x5782;&#x76F4;&#x6392;&#x5217;&#x3002;<br>&#x90A3;&#x4E48;IFC&#x4E00;&#x822C;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#x5462;&#xFF1F;<br>&#x6C34;&#x5E73;&#x5C45;&#x4E2D;&#xFF1A;&#x5F53;&#x4E00;&#x4E2A;&#x5757;&#x8981;&#x5728;&#x73AF;&#x5883;&#x4E2D;&#x6C34;&#x5E73;&#x5C45;&#x4E2D;&#x65F6;&#xFF0C;&#x8BBE;&#x7F6E;&#x5176;&#x4E3A;inline-block&#x5219;&#x4F1A;&#x5728;&#x5916;&#x5C42;&#x4EA7;&#x751F;IFC&#xFF0C;&#x901A;&#x8FC7;text-align&#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x5176;&#x6C34;&#x5E73;&#x5C45;&#x4E2D;&#x3002;<br>&#x5782;&#x76F4;&#x5C45;&#x4E2D;&#xFF1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;IFC&#xFF0C;&#x7528;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x6491;&#x5F00;&#x7236;&#x5143;&#x7D20;&#x7684;&#x9AD8;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x8BBE;&#x7F6E;&#x5176;vertical-align:middle&#xFF0C;&#x5176;&#x4ED6;&#x884C;&#x5185;&#x5143;&#x7D20;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x6B64;&#x7236;&#x5143;&#x7D20;&#x4E0B;&#x5782;&#x76F4;&#x5C45;&#x4E2D;&#x3002;<br>GFC<br>GFC(GridLayout Formatting Contexts)&#x76F4;&#x8BD1;&#x4E3A;&#x201D;&#x7F51;&#x683C;&#x5E03;&#x5C40;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#x201D;&#xFF0C;&#x5F53;&#x4E3A;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;display&#x503C;&#x4E3A;grid&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6B64;&#x5143;&#x7D20;&#x5C06;&#x4F1A;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x6E32;&#x67D3;&#x533A;&#x57DF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x7F51;&#x683C;&#x5BB9;&#x5668;&#xFF08;grid container&#xFF09;&#x4E0A;&#x5B9A;&#x4E49;&#x7F51;&#x683C;&#x5B9A;&#x4E49;&#x884C;&#xFF08;grid definition rows&#xFF09;&#x548C;&#x7F51;&#x683C;&#x5B9A;&#x4E49;&#x5217;&#xFF08;grid definition columns&#xFF09;&#x5C5E;&#x6027;&#x5404;&#x5728;&#x7F51;&#x683C;&#x9879;&#x76EE;&#xFF08;grid item&#xFF09;&#x4E0A;&#x5B9A;&#x4E49;&#x7F51;&#x683C;&#x884C;&#xFF08;grid row&#xFF09;&#x548C;&#x7F51;&#x683C;&#x5217;&#xFF08;grid columns&#xFF09;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x7F51;&#x683C;&#x9879;&#x76EE;&#xFF08;grid item&#xFF09;&#x5B9A;&#x4E49;&#x4F4D;&#x7F6E;&#x548C;&#x7A7A;&#x95F4;&#x3002;<br>&#x90A3;&#x4E48;GFC&#x6709;&#x4EC0;&#x4E48;&#x7528;&#x5462;&#xFF0C;&#x548C;table&#x53C8;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;&#x9996;&#x5148;&#x540C;&#x6837;&#x662F;&#x4E00;&#x4E2A;&#x4E8C;&#x7EF4;&#x7684;&#x8868;&#x683C;&#xFF0C;&#x4F46;GridLayout&#x4F1A;&#x6709;&#x66F4;&#x52A0;&#x4E30;&#x5BCC;&#x7684;&#x5C5E;&#x6027;&#x6765;&#x63A7;&#x5236;&#x884C;&#x5217;&#xFF0C;&#x63A7;&#x5236;&#x5BF9;&#x9F50;&#x4EE5;&#x53CA;&#x66F4;&#x4E3A;&#x7CBE;&#x7EC6;&#x7684;&#x6E32;&#x67D3;&#x8BED;&#x4E49;&#x548C;&#x63A7;&#x5236;&#x3002;<br>FFC<br>FFC(Flex Formatting Contexts)&#x76F4;&#x8BD1;&#x4E3A;&#x201D;&#x81EA;&#x9002;&#x5E94;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#x201D;&#xFF0C;display&#x503C;&#x4E3A;flex&#x6216;&#x8005;inline-flex&#x7684;&#x5143;&#x7D20;&#x5C06;&#x4F1A;&#x751F;&#x6210;&#x81EA;&#x9002;&#x5E94;&#x5BB9;&#x5668;&#xFF08;flex container&#xFF09;&#xFF0C;&#x53EF;&#x60DC;&#x8FD9;&#x4E2A;&#x725B;&#x903C;&#x7684;&#x5C5E;&#x6027;&#x53EA;&#x6709;&#x8C37;&#x6B4C;&#x548C;&#x706B;&#x72D0;&#x652F;&#x6301;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x79FB;&#x52A8;&#x7AEF;&#x4E5F;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x81F3;&#x5C11;safari&#x548C;chrome&#x8FD8;&#x662F;OK&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x8FD9;&#x4FE9;&#x5728;&#x79FB;&#x52A8;&#x7AEF;&#x624D;&#x662F;&#x738B;&#x9053;&#x3002;<br>Flex Box &#x7531;&#x4F38;&#x7F29;&#x5BB9;&#x5668;&#x548C;&#x4F38;&#x7F29;&#x9879;&#x76EE;&#x7EC4;&#x6210;&#x3002;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x5143;&#x7D20;&#x7684; display &#x5C5E;&#x6027;&#x4E3A; flex &#x6216; inline-flex &#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x4F38;&#x7F29;&#x5BB9;&#x5668;&#x3002;&#x8BBE;&#x7F6E;&#x4E3A; flex &#x7684;&#x5BB9;&#x5668;&#x88AB;&#x6E32;&#x67D3;&#x4E3A;&#x4E00;&#x4E2A;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x8BBE;&#x7F6E;&#x4E3A; inline-flex &#x7684;&#x5BB9;&#x5668;&#x5219;&#x6E32;&#x67D3;&#x4E3A;&#x4E00;&#x4E2A;&#x884C;&#x5185;&#x5143;&#x7D20;&#x3002;<br>&#x4F38;&#x7F29;&#x5BB9;&#x5668;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x4F38;&#x7F29;&#x9879;&#x76EE;&#x3002;&#x4F38;&#x7F29;&#x9879;&#x76EE;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x3002;&#x4F38;&#x7F29;&#x5BB9;&#x5668;&#x5916;&#x548C;&#x4F38;&#x7F29;&#x9879;&#x76EE;&#x5185;&#x7684;&#x4E00;&#x5207;&#x5143;&#x7D20;&#x90FD;&#x4E0D;&#x53D7;&#x5F71;&#x54CD;&#x3002;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;Flexbox &#x5B9A;&#x4E49;&#x4E86;&#x4F38;&#x7F29;&#x5BB9;&#x5668;&#x5185;&#x4F38;&#x7F29;&#x9879;&#x76EE;&#x8BE5;&#x5982;&#x4F55;&#x5E03;&#x5C40;&#x3002;<br>&#x9189;&#x996E;&#x5C71;&#x6797;&#xFF0C;&#x81EA;&#x662F;&#x95F2;&#x6687;&#x767D;&#x4E91;&#x95F4;&#x3002;&#x7B11;&#x7EA2;&#x5C18;&#xFF0C;&#x603B;&#x662F;&#x7231;&#x6068;&#x8D2A;&#x55D4;&#x75F4;&#x3002;&#x82E5;&#x95EE;&#x4EBA;&#x95F4;&#x900D;&#x9065;&#x5728;&#xFF0C;&#x98CE;&#x751F;&#x4E4B;&#x8C37;&#xFF0C;&#x83B2;&#x5F00;&#x5176;&#x4E2D;&#x3002;<br>&#x8BE6;&#x7EC6;&#x53C2;&#x8003;:<a href="https://www.jianshu.com/p/e75f351e11f8" target="_blank" rel="noopener">css3&#x4E2D;&#x7684;BFC,IFC,GFC&#x548C;FFC </a></p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2017-10-30T01:24:17.000Z" itemprop="datePublished">2017-10-30</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a href="/blog/2017/11/15/ubuntu_tips20171115/" class="ui tiny button">

                    <i class="angle left icon"></i>
                    
                    ubuntu 16.04 装机攻略
                    

                </a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/blog/2017/08/01/css_学习笔记20170801/" class="ui tiny button">
                    
                    css 学习笔记
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    <ol class="ui ordered list"><li><a href="#CSS相关"><span>CSS相关</span></a></li></ol>
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2019 <a href="/">GENERALTUNE</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/blog/js/semantic-ui-algolia.js"></script>

<script src="/blog/js/aloha-events.js"></script>



</body>
</html>
