

<!DOCTYPE html>
<html lang>
<head prefix="og: http://ogp.me/ns#"><meta name="generator" content="Hexo 3.9.0">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content>
    <title>页面卡顿优化 | generaltune&#39;s blog</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x505A;&amp;#x9879;&amp;#x76EE;&amp;#x65F6;&amp;#x9047;&amp;#x5230;&amp;#x4E86;&amp;#x9875;&amp;#x9762;&amp;#x52A0;&amp;#x8F7D;&amp;#x5361;&amp;#x987F;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x4E00;&amp;#x65F6;&amp;#x6CA1;&amp;#x6709;&amp;#x5934;&amp;#x7EEA;&amp;#xFF0C;">
<meta property="og:type" content="article">
<meta property="og:title" content="页面卡顿优化">
<meta property="og:url" content="https://generaltune.github.io/myblog/2018/02/25/pageoptimization/index.html">
<meta property="og:site_name" content="generaltune&#39;s blog">
<meta property="og:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x505A;&amp;#x9879;&amp;#x76EE;&amp;#x65F6;&amp;#x9047;&amp;#x5230;&amp;#x4E86;&amp;#x9875;&amp;#x9762;&amp;#x52A0;&amp;#x8F7D;&amp;#x5361;&amp;#x987F;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x4E00;&amp;#x65F6;&amp;#x6CA1;&amp;#x6709;&amp;#x5934;&amp;#x7EEA;&amp;#xFF0C;">
<meta property="og:locale" content="default">
<meta property="og:updated_time" content="2019-07-03T03:52:29.684Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="页面卡顿优化">
<meta name="twitter:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x505A;&amp;#x9879;&amp;#x76EE;&amp;#x65F6;&amp;#x9047;&amp;#x5230;&amp;#x4E86;&amp;#x9875;&amp;#x9762;&amp;#x52A0;&amp;#x8F7D;&amp;#x5361;&amp;#x987F;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x4E00;&amp;#x65F6;&amp;#x6CA1;&amp;#x6709;&amp;#x5934;&amp;#x7EEA;&amp;#xFF0C;">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "GENERALTUNE",
  "url": "https://generaltune.github.io/myblog"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/myblog/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>generaltune&#39;s blog</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/myblog/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">GENERALTUNE</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/myblog" class="item">
        <i class="主页 icon"></i>
        首页
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-pageoptimization" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    页面卡顿优化
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>&#x6700;&#x8FD1;&#x505A;&#x9879;&#x76EE;&#x65F6;&#x9047;&#x5230;&#x4E86;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x5361;&#x987F;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x65F6;&#x6CA1;&#x6709;&#x5934;&#x7EEA;&#xFF0C;&#x611F;&#x5230;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6240;&#x4EE5;&#x6574;&#x4F53;&#x68B3;&#x7406;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5728;&#x6B64;&#x8BB0;&#x5F55;&#x3002;</p>
<p>&#x5728;&#x5BCC;&#x5BA2;&#x6237;&#x7AEF;&#x7F51;&#x9875;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x754C;&#x9762;&#x4E0A;&#x7684;UI&#x7684;&#x66F4;&#x6539;&#x662F;&#x901A;&#x8FC7;DOM&#x64CD;&#x4F5C;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;DOM&#x63D0;&#x4F9B;&#x4E86;&#x4E30;&#x5BCC;&#x63A5;&#x53E3;&#x4F9B;&#x5916;&#x90E8;&#x8C03;&#x7528;&#xFF0C;&#x4F46;&#x662F;dom&#x64CD;&#x4F5C;&#x7684;&#x4EE3;&#x4EF7;&#x5F88;&#x9AD8;&#xFF0C;</p>
<p>&#x9875;&#x9762;&#x524D;&#x7AEF;&#x4EE3;&#x7801;&#x7684;&#x6027;&#x80FD;&#x74F6;&#x9888;&#x5927;&#x591A;&#x96C6;&#x4E2D;&#x5728;DOM&#x64CD;&#x4F5C;&#x4E0A;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x524D;&#x7AEF;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x7684;</p>
<p>&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x5173;&#x6CE8;&#x70B9;&#x662F;dom&#x64CD;&#x4F5C;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x60F3;&#x529E;&#x6CD5;&#x901A;&#x8FC7;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;</p>
<p>DOM&#x64CD;&#x4F5C;&#x6765;&#x4F18;&#x5316;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;DOM&#x64CD;&#x4F5C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x5F71;&#x54CD;&#x6027;&#x80FD;&#x3002;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;DOM&#x7684;&#x5B9E;&#x73B0;&#x548C;ECMAScript</p>
<p>&#x7684;&#x5B9E;&#x73B0;&#x662F;&#x5206;&#x79BB;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;IE&#x4E2D;&#xFF0C;ECMAScript&#x7684;&#x5B9E;&#x73B0;&#x5728;jscript.dll&#x4E2D;&#xFF0C;&#x800C;DOM&#x7684;</p>
<p>&#x5B9E;&#x73B0;&#x5728;mshtml.dll&#x4E2D;&#xFF1B;&#x5728;chrome&#x4E2D;&#x4F7F;&#x7528;webkit&#x7684;WebCore&#x5904;&#x7406;DOM&#x548C;&#x6E32;&#x67D3;&#xFF0C;&#x4F46;</p>
<p>ECMAScript&#x662F;&#x5728;V8&#x5F15;&#x64CE;&#x4E2D;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5176;&#x4ED6;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x60C5;&#x51B5;&#x7C7B;&#x4F3C;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x8FC7;Javascript</p>
<p>&#x8C03;&#x7528;dom&#x63A5;&#x53E3;&#xFF0C;&#x662F;&#x76F8;&#x5F53;&#x4E8E;&#x4E24;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x4EA4;&#x4E92;&#x3002;&#x76F8;&#x6BD4;&#x8F83;&#x5728;&#x540C;&#x4E00;&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x8FD9;&#x79CD;&#x8DE8;&#x6A21;&#x5757;&#x7684;</p>
<p>&#x8C03;&#x7528;&#x5176;&#x6027;&#x80FD;&#x635F;&#x8017;&#x662F;&#x5F88;&#x9AD8;&#x7684;&#xFF0C;&#x4F46;DOM&#x64CD;&#x4F5C;&#x5BF9;&#x6027;&#x80FD;&#x5F71;&#x54CD;&#x6700;&#x5927;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x5BFC;&#x81F4;&#x4E86;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x91CD;&#x7ED8;</p>
<p>&#x548C;&#x91CD;&#x6392;&#x3002;</p>
<p>&#x6D4F;&#x89C8;&#x5668;&#x6E32;&#x67D3;&#x539F;&#x7406;&#x7684;&#x7B80;&#x5355;&#x8BF4;&#x660E;</p>
<p>&#x4ECE;&#x4E0B;&#x8F7D;&#x6587;&#x6863;&#x5230;&#x6E32;&#x67D3;&#x9875;&#x9762;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x901A;&#x8FC7;&#x89E3;&#x6790;HTML&#x6587;&#x6863;&#x6765;&#x6784;&#x5EFA;DOM&#x6811;&#xFF0C;&#x89E3;&#x6790;</p>
<p>CSS&#x4EA7;&#x751F;CSS&#x89C4;&#x5219;&#x6811;&#x3002;javascript&#x5728;&#x4EE3;&#x7801;&#x89E3;&#x6790;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x4FEE;&#x6539;&#x751F;&#x6210;&#x7684;dom&#x6811;</p>
<p>&#x548C;css&#x89C4;&#x5219;&#x6811;&#xFF0C;&#x4E4B;&#x540E;&#x6839;&#x636E;dom&#x6811;&#x548C;css&#x89C4;&#x5219;&#x6811;&#x6784;&#x5EFA;&#x6E32;&#x67D3;&#x6811;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;css&#x4F1A;&#x6839;&#x636E;</p>
<p>&#x9009;&#x62E9;&#x5668;&#x5339;&#x914D;HTML&#x5143;&#x7D20;&#x3002;&#x6E32;&#x67D3;&#x6811;&#x5305;&#x62EC;&#x4E86;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x8FB9;&#x8DDD;&#x7B49;&#x6837;&#x5F0F;&#x5C5E;&#x6027;&#x3002;&#x6E32;&#x67D3;&#x6811;</p>
<p>&#x4E2D;&#x4E0D;&#x5305;&#x542B;&#x9690;&#x85CF;&#x5143;&#x7D20;&#x53CA;head&#x5143;&#x7D20;&#x7B49;&#x4E0D;&#x53EF;&#x89C1;&#x5143;&#x7D20;&#x3002;&#x6700;&#x540E;&#x6D4F;&#x89C8;&#x5668;&#x6839;&#x636E;&#x5143;&#x7D20;&#x7684;&#x5750;&#x6807;&#x548C;&#x5927;&#x5C0F;</p>
<p>&#x6765;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5E76;&#x7ED8;&#x5236;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#x5230;&#x9875;&#x9762;&#x4E0A;&#x3002;&#x91CD;&#x7ED8;&#x6307;&#x7684;&#x662F;&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;&#x6216;&#x5C3A;&#x5BF8;</p>
<p>&#x53D1;&#x751F;&#x4E86;&#x6539;&#x53D8;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x91CD;&#x65B0;&#x7ED8;&#x5236;&#x9875;&#x9762;&#x4E0A;&#x53D7;&#x5F71;&#x54CD;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x91CD;&#x6392;&#x7684;&#x4EE3;&#x4EF7;&#x9AD8;&#x4E8E;&#x91CD;&#x7ED8;&#x3002;</p>
<p>&#x4E4B;&#x4E0B;&#x7684;DOM&#x64CD;&#x4F5C;&#x4F1A;&#x5BFC;&#x81F4;&#x91CD;&#x7ED8;&#x6216;&#x91CD;&#x6392;&#xFF1A;</p>
<p>1.&#x589E;&#x52A0;&#xFF0C;&#x5220;&#x9664;&#x548C;&#x4FEE;&#x6539;&#x53EF;&#x89C1;DOM&#x5143;&#x7D20;</p>
<ol start="2" class="ui list">
<li>&#x9875;&#x9762;&#x521D;&#x59CB;&#x5316;&#x7684;&#x6E32;&#x67D3;</li>
</ol>
<p>3.&#x79FB;&#x52A8;dom&#x5143;&#x7D20;</p>
<p>4.&#x4FEE;&#x6539;css&#x6837;&#x5F0F;&#xFF0C;&#x6539;&#x53D8;dom&#x5143;&#x7D20;&#x7684;&#x5C3A;&#x5BF8;</p>
<p>5.dom&#x5143;&#x7D20;&#x5185;&#x5BB9;&#x6539;&#x53D8;&#xFF0C;&#x4F7F;&#x5F97;&#x5C3A;&#x5BF8;&#x88AB;&#x6491;&#x5927;</p>
<p>6.&#x6D4F;&#x89C8;&#x5668;&#x7A97;&#x53E3;&#x5C3A;&#x5BF8;&#x6539;&#x53D8;</p>
<p>7.&#x6D4F;&#x89C8;&#x5668;&#x7A97;&#x53E3;&#x6EDA;&#x52A8;</p>
<p>&#x73B0;&#x4EE3;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x9488;&#x5BF9;&#x91CD;&#x6392;&#x6216;&#x91CD;&#x7ED8;&#x505A;&#x6027;&#x80FD;&#x4F18;&#x5316;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x628A;DOM&#x64CD;&#x4F5C;&#x79EF;&#x7D2F;&#x4E00;&#x6279;&#x540E;&#x7EDF;&#x4E00;</p>
<p>&#x505A;&#x4E00;&#x6B21;&#x91CD;&#x6392;&#x6216;&#x91CD;&#x7ED8;&#xFF0C;&#x4F46;&#x5728;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x7ACB;&#x5373;&#x8FDB;&#x884C;&#x91CD;&#x6392;&#x6216;&#x91CD;&#x7ED8;&#xFF0C;&#x6BD4;&#x5982;&#x8BF7;&#x6C42;&#x5982;&#x4E0B;&#x7684;</p>
<p>dom&#x5143;&#x7D20;&#x5E03;&#x5C40;&#x4FE1;&#x606F;</p>
<p>offsetTop/Left/Width/Height</p>
<p>scrollTop/Left/Width/Height</p>
<p>clientTop/Left/Width/Height</p>
<p>getComputeStyle()&#x6216;currentStyle</p>
<p>&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x503C;&#x90FD;&#x662F;&#x52A8;&#x6001;&#x8BA1;&#x7B97;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6D4F;&#x89C8;&#x5668;&#x9700;&#x5C3D;&#x5FEB;&#x5B8C;&#x6210;&#x9875;&#x9762;&#x7ED8;&#x5236;&#xFF0C;&#x8BA1;&#x7B97;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x6253;&#x4E71;&#x4E86;&#x91CD;&#x7ED8;&#x6216;</p>
<p>&#x91CD;&#x6392;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x9075;&#x5FAA;&#x4E00;&#x4E9B;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x6765;&#x964D;&#x4F4E;&#x5F71;&#x54CD;&#x2013;&gt;</p>
<p>&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x5408;&#x5E76;&#x591A;&#x6B64;dom&#x64CD;&#x4F5C;&#x4E3A;&#x5355;&#x6B21;dom&#x64CD;&#x4F5C;</p>
<p>&#x901A;&#x8FC7;class&#x7C7B;&#x540D;&#x6765;&#x5143;&#x7D20;&#x7684;&#x5927;&#x91CF;&#x6837;&#x5F0F;&#x66F4;&#x6539;&#xFF0C;&#x4EE3;&#x7801;&#x7EF4;&#x62A4;&#x6027;&#x8F83;&#x597D;&#x3002;</p>
<p>&#x901A;&#x8FC7;innerHTML&#x63A5;&#x53E3;&#x6765;&#x4FEE;&#x6539;DOM&#x5143;&#x7D20;&#x7684;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x4EE5;&#x5B57;&#x7B26;&#x4E32;&#x65B9;&#x5F0F;&#x62FC;&#x63A5;&#x597D;&#x4EE3;&#x7801;&#x540E;&#xFF0C;&#x4E00;&#x6B21;&#x6027;&#x8D4B;&#x503C;&#x7ED9;</p>
<p>DOM&#x5143;&#x7D20;&#x7684;innerHTML&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A; &#x628A;DOM&#x5143;&#x7D20;&#x79BB;&#x7EBF;&#x6216;&#x9690;&#x85CF;&#x540E;&#x4FEE;&#x6539;</p>
<p>&#x628A;&#x5143;&#x7D20;&#x4ECE;&#x9875;&#x9762;&#x6D41;&#x4E2D;&#x8131;&#x79BB;&#x6216;&#x9690;&#x85CF;&#xFF0C;&#x8FD9;&#x6837;&#x5904;&#x7406;&#x540E;&#xFF0C;&#x53EA;&#x4F1A;&#x5728;DOM&#x5143;&#x7D20;&#x8131;&#x79BB;&#x6216;&#x6DFB;&#x52A0;&#x65F6;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x9690;&#x85CF;&#x6216;&#x663E;&#x793A;&#x65F6;&#x624D;&#x4F1A;&#x9020;&#x6210;&#x9875;&#x9762;&#x7684;&#x91CD;&#x7ED8;&#x4F1A;&#x91CD;&#x6392;&#xFF0C;&#x5BF9;&#x8131;&#x79BB;&#x4E86;&#x9875;&#x9762;&#x5E03;&#x5C40;&#x7684;DOM&#x5143;&#x7D20;&#x64CD;&#x4F5C;&#x5C31;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x9875;&#x9762;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x9002;&#x5408;&#x9700;&#x8981;&#x5927;&#x6279;&#x91CF;&#x4FEE;&#x6539;dom&#x5143;&#x7D20;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5177;&#x4F53;&#x65B9;&#x5F0F;&#x7531;&#x4E09;&#x79CD;&#xFF1A;</p>
<p>(1) &#x4F7F;&#x7528;&#x6587;&#x6863;&#x7247;&#x6BB5;</p>
<p>&#x6587;&#x6863;&#x7247;&#x6BB5;&#x662F;&#x4E00;&#x4E2A;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;document&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x548C;&#x7279;&#x5B9A;&#x7684;&#x9875;&#x9762;&#x5173;&#x8054;&#xFF0C;&#x901A;&#x8FC7;&#x5728;&#x6587;&#x6863;&#x7247;&#x6BB5;&#x4E0A;&#x8FDB;&#x884C;DOM&#x64CD;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;DOM&#x64CD;&#x4F5C;&#x5BF9;&#x9875;&#x9762;&#x6027;&#x80FD;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x7247;&#x6BB5;&#xFF0C;&#x5E76;&#x5728;&#x6B64;&#x7247;&#x6BB5;&#x4E0A;</p>
<p>&#x8FDB;&#x884C;&#x5FC5;&#x8981;&#x7684;DOM&#x64CD;&#x4F5C;&#xFF0C;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x540E;&#x5C06;&#x5B83;&#x9644;&#x52A0;&#x5728;&#x9875;&#x9762;&#x4E2D;&#xFF0C;&#x5BF9;&#x9875;&#x9762;&#x7684;&#x5F71;&#x54CD;&#x53EA;&#x5B58;&#x5728;&#x4E8E;&#x6700;&#x540E;&#x628A;&#x6587;&#x6863;&#x7247;&#x6BB5;&#x9644;&#x52A0;&#x5230;&#x9875;&#x9762;&#x7684;&#x8FD9;&#x4E00;&#x6B65;&#x64CD;&#x4F5C;&#x4E0A;&#x3002;</p>
<p>var fragment=document.createDocumentFragment();</p>
<p>//&#x4E00;&#x4E9B;&#x57FA;&#x4E8E;fragment&#x7684;&#x5927;&#x91CF;dom&#x64CD;&#x4F5C;</p>
<p>&#x2026;</p>
<p>document.getElementById(&#x2018;myElement&#x2019;).appendChild(fragment);</p>
<p>(2)&#x9690;&#x85CF;&#x5143;&#x7D20;</p>
<p>&#x901A;&#x8FC7;&#x9690;&#x85CF;&#x5143;&#x7D20;&#xFF0C;&#x8FBE;&#x5230;&#x5728;&#x9875;&#x9762;&#x4E0A;&#x79FB;&#x9664;&#x5143;&#x7D20;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x7ECF;&#x8FC7;&#x5927;&#x91CF;&#x7684;DOM&#x64CD;&#x4F5C;&#x540E;&#x6062;&#x590D;&#x5143;&#x7D20;&#x539F;&#x6765;&#x7684;display&#x6837;&#x5F0F;&#xFF0C;&#x53EA;&#x6709;&#x9690;&#x85CF;&#x548C;&#x663E;&#x793A;&#x5143;&#x7D20;&#x65F6;&#x4F1A;&#x5F15;&#x8D77;&#x9875;&#x9762;&#x91CD;&#x7ED8;&#x6216;&#x91CD;&#x6392;&#x64CD;&#x4F5C;&#x3002;</p>
<p>var myElement=document.getElementById(&#x2018;myElement&#x2019;)&#xFF1B;<br>myElement.style.display=&#x2019;none&#x2019;;</p>
<p>//dom&#x64CD;&#x4F5C;</p>
<p>myElement.style.display=&#x2019;block&#x2019;;</p>
<p>(3)&#x514B;&#x9686;DOM&#x5143;&#x7D20;&#x5230;&#x5185;&#x5B58;&#x4E2D;</p>
<p>&#x628A;&#x9875;&#x9762;&#x4E0A;&#x7684;DOM&#x5143;&#x7D20;&#x514B;&#x9686;&#x4E00;&#x4EFD;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x64CD;&#x4F5C;&#x514B;&#x9686;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x540E;&#x4F7F;&#x7528;&#x6B64;&#x514B;&#x9686;&#x5143;&#x7D20;&#x66FF;&#x6362;&#x9875;&#x9762;&#x4E2D;&#x539F;&#x6765;&#x7684;DOM&#x5143;&#x7D20;&#xFF0C;&#x53EA;&#x6709;&#x66FF;&#x6362;&#x5143;&#x7D20;&#x65F6;&#x4F1A;&#x5F71;&#x54CD;&#x6027;&#x80FD;,&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x64CD;&#x4F5C;&#x514B;&#x9686;&#x5143;&#x7D20;&#x4E0D;&#x4F1A;&#x5F15;&#x8D77;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x6027;&#x80FD;&#x635F;&#x8017;&#x3002;</p>
<p>var old=document.getElementById(&#x2018;myElement&#x2019;);</p>
<p>var clone=old.cloneNode(true);</p>
<p>//dom&#x64CD;&#x4F5C;</p>
<p>old.parentNode.replaceChild(clone,old);</p>
<p>3.&#x8BBE;&#x7F6E;&#x5177;&#x6709;&#x52A8;&#x753B;&#x6548;&#x679C;&#x7684;DOM&#x5143;&#x7D20;&#x7684;position&#x5C5E;&#x6027;&#x4E3A;fixed&#x6216;absolute</p>
<p>&#x628A;&#x9875;&#x9762;&#x4E2D;&#x5177;&#x6709;&#x52A8;&#x753B;&#x6548;&#x679C;&#x7684;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;&#x4E3A;&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#xFF0C;&#x4F7F;&#x5F97;&#x5143;&#x7D20;&#x8131;&#x79BB;&#x9875;&#x9762;&#x5E03;&#x5C40;&#x6D41;&#xFF0C;&#x4ECE;&#x672A;&#x907F;&#x514D;&#x4E86;&#x9875;&#x9762;&#x9891;&#x7E41;&#x7684;&#x91CD;&#x6392;&#xFF0C;&#x53EA;&#x6D89;&#x53CA;&#x52A8;&#x753B;&#x5143;&#x7D20;&#x81EA;&#x8EAB;&#x7684;&#x91CD;&#x6392;&#x3002;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x52A8;&#x753B;&#x6548;&#x679C;&#x7684;&#x5C55;&#x793A;&#x6027;&#x80FD;&#x3002;(&#x5728;&#x52A8;&#x753B;&#x5F00;&#x59CB;&#x65F6;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A;&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#xFF0C;&#x7B49;&#x52A8;&#x753B;&#x7ED3;&#x675F;&#x540E;&#x6062;&#x590D;&#x539F;&#x59CB;&#x7684;&#x5B9A;&#x4F4D;&#x8BBE;&#x7F6E;)&#x3002;</p>
<p>4.&#x8C28;&#x614E;&#x83B7;&#x5F97;dom&#x5143;&#x7D20;&#x7684;&#x5E03;&#x5C40;&#x4FE1;&#x606F;&#xFF0C;&#x53D8;&#x91CF;&#x672C;&#x5730;&#x5316;&#x3002;</p>
<p>&#x628A;&#x83B7;&#x53D6;&#x5230;&#x7684;&#x5143;&#x7D20;&#x7684;&#x5E03;&#x5C40;&#x4FE1;&#x606F;&#x503C;&#x7F13;&#x5B58;&#x5728;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E2D;&#x3002;&#x5728;&#x6709;&#x5927;&#x91CF;&#x7684;DOM&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x907F;&#x514D;&#x83B7;&#x53D6;dom&#x5143;&#x7D20;&#x7684;&#x5E03;&#x5C40;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x5E03;&#x5C40;&#x4FE1;&#x606F;&#xFF0C;&#x6700;&#x597D;&#x5728;DOM&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#x5C31;&#x53D6;&#x597D;&#x5B58;&#x653E;&#x3002;</p>
<p>5.&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x6258;&#x7BA1;&#x65B9;&#x5F0F;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;</p>
<p>&#x5728;DOM&#x5143;&#x7D20;&#x4E0A;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#x6216;&#x5F71;&#x54CD;&#x9875;&#x9762;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#x672C;&#x8EAB;&#x4F1A;&#x5360;&#x7528;&#x5904;&#x7406;&#x65F6;&#x95F4;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4FDD;&#x5B58;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x4E5F;&#x4F1A;&#x5360;&#x7528;&#x5185;&#x5B58;&#x3002;&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x6258;&#x7BA1;&#x65B9;&#x5F0F;&#xFF0C;&#x5373;&#x5229;&#x7528;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;&#x673A;&#x5236;&#xFF0C;&#x53EA;&#x5728;&#x7236;&#x5143;&#x7D20;&#x4E0A;&#x7ED1;&#x5B9A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#xFF0C;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x6240;&#x6709;&#x5B50;&#x5143;&#x7D20;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x5728;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x51FD;&#x6570;&#x4E2D;&#x6839;&#x636E;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x5224;&#x65AD;&#x4E8B;&#x4EF6;&#x6E90;&#x5143;&#x7D20;&#xFF0C;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x5143;&#x7D20;&#x505A;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6709;&#x5F88;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x7684;&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x5B50;&#x5143;&#x7D20;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x56E0;&#x5143;&#x7D20;&#x79FB;&#x9664;&#x6216;&#x6DFB;&#x52A0;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x4E8B;&#x4EF6;&#x7ED1;&#x5B9A;&#x3002;</p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2018-02-25T08:12:01.000Z" itemprop="datePublished">2018-02-25</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a href="/myblog/2018/03/01/csslayout/" class="ui tiny button">

                    <i class="angle left icon"></i>
                    
                    css 布局整理
                    

                </a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/myblog/2018/02/07/interview-tips/" class="ui tiny button">
                    
                    面试合集
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2019 <a href="/">GENERALTUNE</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/myblog/js/semantic-ui-algolia.js"></script>

<script src="/myblog/js/aloha-events.js"></script>



</body>
</html>
