

<!DOCTYPE html>
<html lang>
<head prefix="og: http://ogp.me/ns#"><meta name="generator" content="Hexo 3.9.0">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content>
    <title>人工智能 | generaltune&#39;s blog</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#x8003;&amp;#x8651;&amp;#x5230;&amp;#x4EBA;&amp;#x5DE5;&amp;#x667A;&amp;#x80FD;&amp;#x5982;&amp;#x6B64;&amp;#x53D7;&amp;#x5173;&amp;#x6CE8;&amp;#xFF0C;&amp;#x65AF;&amp;#x5766;&amp;#x798F;&amp;#x5927;&amp;#x5B66;&amp;#x7684;&amp;#x4E13;&amp;#x5BB6;&amp;#x6700;&amp;#x8FD1;&amp;#x64B0;&amp;#x5199;">
<meta property="og:type" content="article">
<meta property="og:title" content="人工智能">
<meta property="og:url" content="https://generaltune.github.io/blog/2017/01/17/20170117/index.html">
<meta property="og:site_name" content="generaltune&#39;s blog">
<meta property="og:description" content="&amp;#x8003;&amp;#x8651;&amp;#x5230;&amp;#x4EBA;&amp;#x5DE5;&amp;#x667A;&amp;#x80FD;&amp;#x5982;&amp;#x6B64;&amp;#x53D7;&amp;#x5173;&amp;#x6CE8;&amp;#xFF0C;&amp;#x65AF;&amp;#x5766;&amp;#x798F;&amp;#x5927;&amp;#x5B66;&amp;#x7684;&amp;#x4E13;&amp;#x5BB6;&amp;#x6700;&amp;#x8FD1;&amp;#x64B0;&amp;#x5199;">
<meta property="og:locale" content="default">
<meta property="og:updated_time" content="2019-07-03T03:52:29.684Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="人工智能">
<meta name="twitter:description" content="&amp;#x8003;&amp;#x8651;&amp;#x5230;&amp;#x4EBA;&amp;#x5DE5;&amp;#x667A;&amp;#x80FD;&amp;#x5982;&amp;#x6B64;&amp;#x53D7;&amp;#x5173;&amp;#x6CE8;&amp;#xFF0C;&amp;#x65AF;&amp;#x5766;&amp;#x798F;&amp;#x5927;&amp;#x5B66;&amp;#x7684;&amp;#x4E13;&amp;#x5BB6;&amp;#x6700;&amp;#x8FD1;&amp;#x64B0;&amp;#x5199;">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "GENERALTUNE",
  "url": "https://generaltune.github.io/blog"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/blog/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>generaltune&#39;s blog</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/blog/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">GENERALTUNE</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/blog" class="item">
        <i class="主页 icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-20170117" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    人工智能
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>&#x8003;&#x8651;&#x5230;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5982;&#x6B64;&#x53D7;&#x5173;&#x6CE8;&#xFF0C;&#x65AF;&#x5766;&#x798F;&#x5927;&#x5B66;&#x7684;&#x4E13;&#x5BB6;&#x6700;&#x8FD1;&#x64B0;&#x5199;&#x7684;&#x4E00;&#x4EFD;&#x667A;&#x80FD;&#x7814;&#x7A76;&#x62A5;&#x544A;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF1A;&#x201C;&#x73B0;&#x5728;&#x5230;2030&#x5E74;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x8D8A;&#x6765;&#x8D8A;&#x6709;&#x7528;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x793E;&#x4F1A;&#x548C;&#x7ECF;&#x6D4E;&#x5E26;&#x6765;&#x6DF1;&#x8FDC;&#x7684;&#x79EF;&#x6781;&#x5F71;&#x54CD;&#xFF0C;&#x201D;&#x4E5F;&#x5C31;&#x4E0D;&#x8DB3;&#x4E3A;&#x5947;&#x4E86;&#x3002;&#x6B64;&#x6587;&#x7740;&#x91CD;&#x4ECB;&#x7ECD;15&#x4E2A;&#x77E5;&#x540D;&#x5EA6;&#x6700;&#x5927;&#x7684;&#x5F00;&#x6E90;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x9879;&#x76EE;&#x3002;</p>
<ol class="ui list">
<li>Caffe</li>
</ol>
<p>Caffe&#x662F;&#x52A0;&#x5DDE;&#x5927;&#x5B66;&#x4F2F;&#x514B;&#x5229;&#x5206;&#x6821;&#x653B;&#x8BFB;&#x535A;&#x58EB;&#x5B66;&#x4F4D;&#x8005;&#x7684;&#x6770;&#x4F5C;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6846;&#x67B6;&#xFF0C;&#x57FA;&#x4E8E;&#x8868;&#x8FBE;&#x5F0F;&#x67B6;&#x6784;&#x548C;&#x53EF;&#x6269;&#x5C55;&#x4EE3;&#x7801;&#x3002;&#x901F;&#x5EA6;&#x5FEB;&#x662F;&#x5B83;&#x8D56;&#x4EE5;&#x6210;&#x540D;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x56E0;&#x800C;&#x5728;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x548C;&#x4F01;&#x4E1A;&#x7528;&#x6237;&#x5F53;&#x4E2D;&#x90FD;&#x5907;&#x53D7;&#x6B22;&#x8FCE;&#x3002;&#x636E;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#x58F0;&#x79F0;&#xFF0C;&#x4EC5;&#x4EC5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x82F1;&#x4F1F;&#x8FBE;K40 GPU&#xFF0C;&#x5B83;&#x5728;&#x77ED;&#x77ED;&#x4E00;&#x5929;&#x5185;&#x5C31;&#x80FD;&#x591F;&#x5904;&#x7406;6000&#x591A;&#x4E07;&#x4E2A;&#x56FE;&#x50CF;&#x3002;&#x5B83;&#x7531;&#x4F2F;&#x514B;&#x5229;&#x89C6;&#x89C9;&#x548C;&#x5B66;&#x4E60;&#x4E2D;&#x5FC3;(BVLC)&#x7BA1;&#x7406;&#xFF0C;&#x82F1;&#x4F1F;&#x8FBE;&#x548C;&#x4E9A;&#x9A6C;&#x900A;&#x7B49;&#x516C;&#x53F8;&#x63D0;&#x4F9B;&#x4E86;&#x62E8;&#x6B3E;&#xFF0C;&#x652F;&#x6301;&#x5B83;&#x7684;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="http://caffe.berkeleyvision.org" target="_blank" rel="noopener">http://caffe.berkeleyvision.org</a></p>
<ol start="2" class="ui list">
<li>CNTK</li>
</ol>
<p>CNTK&#x7684;&#x5168;&#x79F0;&#x662F;&#x8BA1;&#x7B97;&#x7F51;&#x7EDC;&#x5DE5;&#x5177;&#x5305;&#xFF0C;&#x5B83;&#x662F;&#x5FAE;&#x8F6F;&#x7684;&#x5F00;&#x6E90;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5DE5;&#x5177;&#x4E4B;&#x4E00;&#x3002;&#x5B83;&#x58F0;&#x79F0;&#x62E5;&#x6709;&#x51FA;&#x4F17;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x65E0;&#x8BBA;&#x5728;&#x53EA;&#x6709;&#x4E00;&#x4E2A;CPU&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x8FD8;&#x662F;&#x5728;&#x62E5;&#x6709;&#x591A;&#x4E2A;GPU&#x7684;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x90FD;&#x662F;&#x5982;&#x6B64;&#x3002;&#x5FAE;&#x8F6F;&#x4E3B;&#x8981;&#x7528;&#x5B83;&#x6765;&#x7814;&#x7A76;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x540C;&#x6837;&#x9002;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x9886;&#x57DF;&#xFF0C;&#x6BD4;&#x5982;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x3001;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x3001;&#x56FE;&#x50CF;&#x5B57;&#x5E55;&#x3001;&#x6587;&#x672C;&#x5904;&#x7406;&#x3001;&#x8BED;&#x8A00;&#x7406;&#x89E3;&#x548C;&#x8BED;&#x8A00;&#x5EFA;&#x6A21;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="https://www.cntk.ai" target="_blank" rel="noopener">https://www.cntk.ai</a></p>
<ol start="3" class="ui list">
<li>Deeplearning4j</li>
</ol>
<p>Deeplearning4j&#x662F;&#x4E00;&#x79CD;&#x9762;&#x5411;Java&#x865A;&#x62DF;&#x673A;(JVM)&#x7684;&#x5F00;&#x6E90;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5E93;&#x3002;&#x5B83;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x73AF;&#x5883;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x53EF;&#x4E0E;Hadoop&#x548C;Apache Spark&#x6574;&#x5408;&#x8D77;&#x6765;&#x3002;&#x5B83;&#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x4E0E;Java&#x3001;Scala&#x53CA;&#x5176;&#x4ED6;JVM&#x8BED;&#x8A00;&#x517C;&#x5BB9;&#x3002;</p>
<p>&#x8BE5;&#x9879;&#x76EE;&#x7531;&#x4E00;&#x5BB6;&#x540D;&#x4E3A;Skymind&#x7684;&#x5546;&#x4E1A;&#x516C;&#x53F8;&#x7BA1;&#x7406;&#xFF0C;&#x8BE5;&#x516C;&#x53F8;&#x63D0;&#x4F9B;&#x6536;&#x8D39;&#x7684;&#x652F;&#x6301;&#x3001;&#x57F9;&#x8BAD;&#x548C;Deeplearning4j&#x7684;&#x4F01;&#x4E1A;&#x53D1;&#x884C;&#x7248;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="http://deeplearning4j.org" target="_blank" rel="noopener">http://deeplearning4j.org</a></p>
<ol start="4" class="ui list">
<li>&#x5206;&#x5E03;&#x5F0F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5DE5;&#x5177;&#x5305;</li>
</ol>
<p>&#x4E0E;CNTK&#x4E00;&#x6837;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5DE5;&#x5177;&#x5305;(DMTK)&#x662F;&#x5FAE;&#x8F6F;&#x7684;&#x5F00;&#x6E90;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5DE5;&#x5177;&#x4E4B;&#x4E00;&#x3002;&#x5B83;&#x662F;&#x4E3A;&#x5927;&#x6570;&#x636E;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x8BBE;&#x8BA1;&#xFF0C;&#x65E8;&#x5728;&#x66F4;&#x5FEB;&#x5730;&#x8BAD;&#x7EC3;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7CFB;&#x7EDF;&#x3002;&#x5B83;&#x5305;&#x62EC;&#x4E09;&#x5927;&#x90E8;&#x5206;&#xFF1A;DMTK&#x6846;&#x67B6;&#x3001;LightLDA&#x4E3B;&#x9898;&#x6A21;&#x578B;&#x7B97;&#x6CD5;&#x4EE5;&#x53CA;&#x5206;&#x5E03;&#x5F0F;(Multisense)&#x5355;&#x8BCD;&#x5D4C;&#x5165;&#x7B97;&#x6CD5;&#x3002;&#x5FAE;&#x8F6F;&#x58F0;&#x79F0;&#xFF0C;&#x5728;8&#x4E2A;&#x96C6;&#x7FA4;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x201C;&#x9488;&#x5BF9;&#x62E5;&#x6709;1000&#x591A;&#x4EBF;&#x4E2A;&#x6743;&#x6807;&#x7684;&#x6587;&#x6863;&#x96C6;&#x5408;&#xFF0C;&#x8BAD;&#x7EC3;&#x62E5;&#x6709;100&#x4E07;&#x4E2A;&#x4E3B;&#x9898;&#x548C;1000&#x4E07;&#x4E2A;&#x5355;&#x8BCD;&#x8BCD;&#x6C47;&#x8868;(&#x5171;&#x6709;10&#x4E07;&#x4EBF;&#x4E2A;&#x53C2;&#x6570;)&#x7684;&#x4E3B;&#x9898;&#x6A21;&#x578B;&#xFF0C;&#x201D;&#x8FD9;&#x4E2A;&#x6210;&#x7EE9;&#x662F;&#x5176;&#x4ED6;&#x5DE5;&#x5177;&#x65E0;&#x6CD5;&#x6BD4;&#x62DF;&#x7684;&#xFF0C;&#x8FD9;&#x4E5F;&#x8BC1;&#x660E;&#x4E86;DMTK&#x7684;&#x901F;&#x5EA6;&#x6709;&#x591A;&#x5FEB;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="http://www.dmtk.io" target="_blank" rel="noopener">http://www.dmtk.io</a></p>
<ol start="5" class="ui list">
<li>H2O</li>
</ol>
<p>H2O&#x66F4;&#x52A0;&#x4E13;&#x6CE8;&#x4E8E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5728;&#x4F01;&#x4E1A;&#x9886;&#x57DF;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5B83;&#x7684;&#x7528;&#x6237;&#x5305;&#x62EC;&#x8BF8;&#x591A;&#x5927;&#x516C;&#x53F8;&#xFF1A;&#x7B2C;&#x4E00;&#x8D44;&#x672C;&#x3001;&#x601D;&#x79D1;&#x3001;&#x5C3C;&#x5C14;&#x68EE;Catalina&#x3001;&#x8D1D;&#x5B9D;&#x53CA;Transamerica&#x3002;&#x5B83;&#x58F0;&#x79F0;&#x8BA9;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x548C;&#x9884;&#x6D4B;&#x5206;&#x6790;&#x7684;&#x5F3A;&#x5927;&#x529F;&#x80FD;&#xFF0C;&#x89E3;&#x51B3;&#x4E1A;&#x52A1;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x53EF;&#x7528;&#x4E8E;&#x9884;&#x6D4B;&#x5EFA;&#x6A21;&#x3001;&#x98CE;&#x9669;&#x53CA;&#x6B3A;&#x8BC8;&#x5206;&#x6790;&#x3001;&#x4FDD;&#x9669;&#x5206;&#x6790;&#x3001;&#x5E7F;&#x544A;&#x6280;&#x672F;&#x3001;&#x533B;&#x7597;&#x4FDD;&#x5065;&#x548C;&#x5BA2;&#x6237;&#x60C5;&#x62A5;&#x3002;</p>
<p>&#x5B83;&#x6709;&#x4E24;&#x79CD;&#x5F00;&#x6E90;&#x7248;&#x672C;&#xFF1A;&#x6807;&#x51C6;&#x7684;H2O&#x548C;Sparkling Water&#xFF0C;&#x540E;&#x8005;&#x4E0E;Apache Spark&#x96C6;&#x6210;&#x8D77;&#x6765;&#x3002;&#x5B83;&#x8FD8;&#x63D0;&#x4F9B;&#x6536;&#x8D39;&#x7684;&#x4F01;&#x4E1A;&#x652F;&#x6301;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="http://www.h2o.ai" target="_blank" rel="noopener">http://www.h2o.ai</a></p>
<ol start="6" class="ui list">
<li>Mahout</li>
</ol>
<p>Mahout&#x662F;Apache&#x57FA;&#x91D1;&#x4F1A;&#x4E0B;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x5F00;&#x6E90;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6846;&#x67B6;&#x3002;&#x636E;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#x58F0;&#x79F0;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E09;&#x79CD;&#x4E3B;&#x8981;&#x7684;&#x7279;&#x6027;&#xFF1A;&#x7528;&#x4E8E;&#x6784;&#x5EFA;&#x53EF;&#x6269;&#x5C55;&#x7B97;&#x6CD5;&#x7684;&#x7F16;&#x7A0B;&#x73AF;&#x5883;&#x3001;&#x9762;&#x5411;Spark&#x548C;H2O&#x7B49;&#x5DE5;&#x5177;&#x7684;&#x9884;&#x5236;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x540D;&#x4E3A;Samsara&#x7684;&#x5411;&#x91CF;&#x6570;&#x5B66;&#x8BD5;&#x9A8C;&#x73AF;&#x5883;&#x3002;&#x4F7F;&#x7528;Mahout&#x7684;&#x516C;&#x53F8;&#x5305;&#x62EC;&#xFF1A;Adobe&#x3001;&#x57C3;&#x68EE;&#x54F2;&#x3001;Foursquare&#x3001;&#x82F1;&#x7279;&#x5C14;&#x3001;&#x9886;&#x82F1;&#x3001;&#x63A8;&#x7279;&#x3001;&#x96C5;&#x864E;&#x53CA;&#x5176;&#x4ED6;&#x8BB8;&#x591A;&#x516C;&#x53F8;&#x3002;&#x53EF;&#x901A;&#x8FC7;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#x4E0A;&#x6240;&#x5217;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x83B7;&#x5F97;&#x4E13;&#x4E1A;&#x652F;&#x6301;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="http://mahout.apache.org" target="_blank" rel="noopener">http://mahout.apache.org</a></p>
<ol start="7" class="ui list">
<li>MLlib</li>
</ol>
<p>Apache Spark&#x4EE5;&#x901F;&#x5EA6;&#x5FEB;&#x8457;&#x79F0;&#xFF0C;&#x5B83;&#x5DF2;&#x6210;&#x4E3A;&#x6700;&#x6D41;&#x884C;&#x7684;&#x5927;&#x6570;&#x636E;&#x5904;&#x7406;&#x5DE5;&#x5177;&#x4E4B;&#x4E00;&#x3002;MLlib&#x662F;Spark&#x7684;&#x53EF;&#x6269;&#x5C55;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E93;&#x3002;&#x5B83;&#x4E0E;Hadoop&#x6574;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x53EF;&#x4E0E;NumPy&#x548C;R&#x534F;&#x540C;&#x64CD;&#x4F5C;&#x3002;&#x5B83;&#x5305;&#x62EC;&#x4E00;&#x5927;&#x6279;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x5206;&#x7C7B;&#x3001;&#x56DE;&#x5F52;&#x3001;&#x51B3;&#x7B56;&#x6811;&#x3001;&#x63A8;&#x8350;&#x3001;&#x805A;&#x7C7B;&#x3001;&#x4E3B;&#x9898;&#x5EFA;&#x6A21;&#x3001;&#x7279;&#x6027;&#x8F6C;&#x6362;&#x3001;&#x6A21;&#x578B;&#x8BC4;&#x4F30;&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7BA1;&#x9053;&#x6784;&#x5EFA;&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6301;&#x4E45;&#x6027;&#x3001;&#x751F;&#x5B58;&#x5206;&#x6790;&#x3001;&#x9891;&#x7E41;&#x9879;&#x96C6;&#x3001;&#x987A;&#x5E8F;&#x6A21;&#x5F0F;&#x6316;&#x6398;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x548C;&#x7EDF;&#x8BA1;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="https://spark.apache.org/mllib/" target="_blank" rel="noopener">https://spark.apache.org/mllib/</a></p>
<ol start="8" class="ui list">
<li>NuPIC</li>
</ol>
<p>NuPIC&#x7531;&#x4E00;&#x5BB6;&#x540D;&#x4E3A;Numenta&#x7684;&#x516C;&#x53F8;&#x7BA1;&#x7406;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5F00;&#x6E90;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x9879;&#x76EE;&#xFF0C;&#x57FA;&#x4E8E;&#x4E00;&#x79CD;&#x540D;&#x4E3A;&#x5206;&#x5C42;&#x5F0F;&#x5373;&#x65F6;&#x8BB0;&#x5FC6;(&#x5373;HTM)&#x7684;&#x7406;&#x8BBA;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;HTM&#x8BD5;&#x56FE;&#x5EFA;&#x7ACB;&#x4E00;&#x79CD;&#x6A21;&#x4EFF;&#x4EBA;&#x7C7B;&#x5927;&#x8111;&#x65B0;&#x76AE;&#x5C42;&#x800C;&#x5EFA;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x3002;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x5236;&#x9020;&#x201C;&#x5904;&#x7406;&#x8BB8;&#x591A;&#x8BA4;&#x77E5;&#x4EFB;&#x52A1;&#x65F6;&#x63A5;&#x8FD1;&#x6216;&#x80DC;&#x8FC7;&#x4EBA;&#x7C7B;&#x8868;&#x73B0;&#x201D;&#x7684;&#x673A;&#x5668;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x5F00;&#x6E90;&#x8BB8;&#x53EF;&#x8BC1;&#x5916;&#xFF0C;Numenta&#x8FD8;&#x63D0;&#x4F9B;&#x91C7;&#x7528;&#x5546;&#x4E1A;&#x8BB8;&#x53EF;&#x8BC1;&#x7684;NuPic&#xFF0C;&#x5B83;&#x8FD8;&#x63D0;&#x4F9B;&#x4F5C;&#x4E3A;&#x5B83;&#x6280;&#x672F;&#x5E95;&#x5C42;&#x7684;&#x4E13;&#x5229;&#x65B9;&#x9762;&#x7684;&#x8BB8;&#x53EF;&#x8BC1;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="http://numenta.org" target="_blank" rel="noopener">http://numenta.org</a></p>
<ol start="9" class="ui list">
<li>OpenNN</li>
</ol>
<p>OpenNN&#x4E3A;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x548C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x800C;&#x8BBE;&#x8BA1;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;C++&#x7F16;&#x7A0B;&#x5E93;&#x3002;&#x4E3B;&#x8981;&#x7279;&#x6027;&#x5305;&#x62EC;&#xFF1A;&#x6DF1;&#x5EA6;&#x67B6;&#x6784;&#x548C;&#x5353;&#x8D8A;&#x6027;&#x80FD;&#x3002;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#x4E0A;&#x6709;&#x5168;&#x9762;&#x7684;&#x8BF4;&#x660E;&#x6587;&#x6863;&#xFF0C;&#x5305;&#x62EC;&#x89E3;&#x91CA;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x7684;&#x5165;&#x95E8;&#x6559;&#x7A0B;&#x3002;&#x53EF;&#x901A;&#x8FC7;Artelnics&#x83B7;&#x5F97;OpenNN&#x7684;&#x6536;&#x8D39;&#x652F;&#x6301;&#xFF0C;&#x603B;&#x90E8;&#x4F4D;&#x4E8E;&#x897F;&#x73ED;&#x7259;&#x7684;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#x4E3B;&#x653B;&#x9884;&#x6D4B;&#x5206;&#x6790;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="http://www.opennn.net" target="_blank" rel="noopener">http://www.opennn.net</a></p>
<ol start="10" class="ui list">
<li>OpenCyc</li>
</ol>
<p>OpenCyc&#x7531;&#x4E00;&#x5BB6;&#x540D;&#x4E3A;Cycorp&#x7684;&#x516C;&#x53F8;&#x5F00;&#x53D1;&#xFF0C;&#x5B83;&#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;Cyc&#x77E5;&#x8BC6;&#x5E93;&#x548C;&#x5E38;&#x8BC6;&#x63A8;&#x7406;&#x5F15;&#x64CE;&#x3002;&#x5B83;&#x5305;&#x62EC;239000&#x591A;&#x4E2A;&#x672F;&#x8BED;&#x3001;&#x7EA6;2093000&#x4E2A;&#x4E09;&#x5143;&#x7EC4;&#x4EE5;&#x53CA;&#x5927;&#x7EA6;69000&#x4E2A;owl:sameAs&#x94FE;&#x63A5;(&#x6307;&#x5411;&#x5916;&#x90E8;&#x8BED;&#x4E49;&#x6570;&#x636E;&#x547D;&#x540D;&#x7A7A;&#x95F4;)&#x3002;&#x5B83;&#x7528;&#x4E8E;&#x4E30;&#x5BCC;&#x57DF;&#x540D;&#x5EFA;&#x6A21;&#x3001;&#x8BED;&#x4E49;&#x6570;&#x636E;&#x6574;&#x5408;&#x3001;&#x6587;&#x672C;&#x7406;&#x89E3;&#x3001;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x7CFB;&#x7EDF;&#x548C;&#x6E38;&#x620F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x3002;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#x8FD8;&#x63D0;&#x4F9B;Cyc&#x7684;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x7248;&#x672C;&#xFF1A;&#x4E00;&#x4E2A;&#x662F;&#x975E;&#x5F00;&#x6E90;&#x514D;&#x8D39;&#x7248;&#x672C;&#xFF0C;&#x9762;&#x5411;&#x7814;&#x7A76;&#x4EBA;&#x5458;;&#x53E6;&#x4E00;&#x4E2A;&#x9762;&#x5411;&#x4F01;&#x4E1A;&#x7528;&#x6237;&#xFF0C;&#x9700;&#x8981;&#x6536;&#x8D39;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="http://www.cyc.com/platform/opencyc/" target="_blank" rel="noopener">http://www.cyc.com/platform/opencyc/</a></p>
<ol start="11" class="ui list">
<li>Oryx 2</li>
</ol>
<p>Oryx 2&#x5EFA;&#x7ACB;&#x5728;Apache Spark&#x548C;Kafka&#x4E0A;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x4E13;&#x95E8;&#x7684;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x6846;&#x67B6;&#xFF0C;&#x9762;&#x5411;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3002;&#x5B83;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x72EC;&#x7279;&#x7684;lambda&#x67B6;&#x6784;&#xFF0C;&#x6709;&#x4E09;&#x4E2A;&#x5C42;&#x6B21;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4F7F;&#x7528;Oryx 2&#x6765;&#x6784;&#x5EFA;&#x65B0;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x8FD8;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x9884;&#x5236;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5904;&#x7406;&#x5E38;&#x89C1;&#x7684;&#x5927;&#x6570;&#x636E;&#x4EFB;&#x52A1;&#xFF0C;&#x6BD4;&#x5982;&#x534F;&#x4F5C;&#x8FC7;&#x6EE4;&#x3001;&#x5206;&#x7C7B;&#x3001;&#x56DE;&#x5F52;&#x548C;&#x805A;&#x7C7B;&#x3002;&#x5927;&#x6570;&#x636E;&#x5DE5;&#x5177;&#x5382;&#x5546;Cloudera&#x5EFA;&#x7ACB;&#x4E86;&#x6700;&#x521D;&#x7684;Oryx 1&#x9879;&#x76EE;&#xFF0C;&#x4E00;&#x76F4;&#x5927;&#x529B;&#x53C2;&#x4E0E;&#x6301;&#x7EED;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="http://oryx.io" target="_blank" rel="noopener">http://oryx.io</a></p>
<ol start="12" class="ui list">
<li>PredictionIO</li>
</ol>
<p>&#x4ECA;&#x5E74;2&#x6708;&#x4EFD;&#xFF0C;Salesforce&#x6536;&#x8D2D;&#x4E86;PredictionIO&#xFF0C;&#x540E;&#x6765;&#x5728;7&#x6708;&#x4EFD;&#xFF0C; &#x5B83;&#x628A;&#x8BE5;&#x5E73;&#x53F0;&#x8FDE;&#x540C;&#x5546;&#x6807;&#x4E00;&#x8D77;&#x6350;&#x732E;&#x7ED9;&#x4E86;Apache&#x57FA;&#x91D1;&#x4F1A;&#xFF0C;&#x8BE5;&#x57FA;&#x91D1;&#x4F1A;&#x5C06;&#x5B83;&#x5217;&#x4E3A;&#x5B75;&#x5316;&#x5668;&#x9879;&#x76EE;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x867D;&#x7136;Salesforce&#x4F7F;&#x7528;PredictionIO&#x6280;&#x672F;&#x6765;&#x5B8C;&#x5584;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x5F00;&#x6E90;&#x7248;&#x672C;&#x65B9;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#x4E5F;&#x4F1A;&#x7EE7;&#x7EED;&#x4E0B;&#x53BB;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x6784;&#x5EFA;&#x62E5;&#x6709;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x529F;&#x80FD;&#x7684;&#x9884;&#x6D4B;&#x5F15;&#x64CE;&#xFF0C;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x53EF;&#x7528;&#x6765;&#x90E8;&#x7F72;&#x5B9E;&#x65F6;&#x54CD;&#x5E94;&#x52A8;&#x6001;&#x67E5;&#x8BE2;&#x7684;Web&#x670D;&#x52A1;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="https://prediction.io" target="_blank" rel="noopener">https://prediction.io</a></p>
<ol start="13" class="ui list">
<li>SystemML</li>
</ol>
<p>SystemML&#x6700;&#x521D;&#x7531;IBM&#x5F00;&#x53D1;&#xFF0C;&#x73B0;&#x5728;&#x5B83;&#x662F;Apache&#x65D7;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#x5927;&#x6570;&#x636E;&#x9879;&#x76EE;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x9AD8;&#x5EA6;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x65BD;&#x7528;R&#x6216;&#x7C7B;&#x4F3C;Python&#x7684;&#x8BED;&#x6CD5;&#x7F16;&#x5199;&#x7684;&#x9AD8;&#x7EA7;&#x8FD0;&#x7B97;&#x548C;&#x7B97;&#x6CD5;&#x3002;&#x4F01;&#x4E1A;&#x5DF2;&#x7ECF;&#x5728;&#x7528;&#x5B83;&#x6765;&#x8DDF;&#x8E2A;&#x6C7D;&#x8F66;&#x7EF4;&#x4FEE;&#x65B9;&#x9762;&#x7684;&#x5BA2;&#x6237;&#x670D;&#x52A1;&#xFF0C;&#x5F15;&#x5BFC;&#x673A;&#x573A;&#x5BA2;&#x6D41;&#x91CF;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x793E;&#x4EA4;&#x5A92;&#x4F53;&#x6570;&#x636E;&#x4E0E;&#x94F6;&#x884C;&#x5BA2;&#x6237;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x5728;Spark&#x6216;Hadoop&#x4E0A;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="http://systemml.apache.org" target="_blank" rel="noopener">http://systemml.apache.org</a></p>
<ol start="14" class="ui list">
<li>TensorFlow</li>
</ol>
<p>TensorFlow&#x662F;&#x8C37;&#x6B4C;&#x7684;&#x5F00;&#x6E90;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5DE5;&#x5177;&#x4E4B;&#x4E00;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x7528;&#x4E8E;&#x6570;&#x5B57;&#x8BA1;&#x7B97;&#x7684;&#x5E93;&#xFF0C;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6D41;&#x56FE;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x4F17;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x642D;&#x8F7D;&#x5355;&#x4E00;&#x6216;&#x591A;&#x4E2A;CPU&#x548C;GPU&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5728;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x5B83;&#x62E5;&#x6709;&#x6DF1;&#x5EA6;&#x7075;&#x6D3B;&#x6027;&#x3001;&#x771F;&#x6B63;&#x7684;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x3001;&#x81EA;&#x52A8;&#x5DEE;&#x5206;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x652F;&#x6301;Python&#x548C;C++&#x3002;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#x4E0A;&#x5217;&#x6709;&#x975E;&#x5E38;&#x4E30;&#x5BCC;&#x7684;&#x6559;&#x7A0B;&#x548C;&#x5B9E;&#x7528;&#x6587;&#x7AE0;&#xFF0C;&#x53EF;&#x4F9B;&#x6709;&#x5174;&#x8DA3;&#x4F7F;&#x7528;&#x6216;&#x6269;&#x5C55;&#x5176;&#x529F;&#x80FD;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6216;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="https://www.tensorflow.org" target="_blank" rel="noopener">https://www.tensorflow.org</a></p>
<ol start="15" class="ui list">
<li>Torch</li>
</ol>
<p>Torch&#x81EA;&#x79F0;&#x662F;&#x201C;&#x4E00;&#x79CD;&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x6846;&#x67B6;&#xFF0C;&#x5E7F;&#x6CDB;&#x652F;&#x6301;&#x628A;GPU&#x653E;&#x5728;&#x9996;&#x4F4D;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x3002;&#x201D;&#x8FD9;&#x91CC;&#x7684;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x901F;&#x5EA6;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x4E0E;&#x4F17;&#x591A;&#x65B9;&#x9762;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#xFF1A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x3001;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x3001;&#x5E76;&#x884C;&#x5904;&#x7406;&#x3001;&#x56FE;&#x50CF;&#x3001;&#x89C6;&#x9891;&#x3001;&#x97F3;&#x9891;&#x548C;&#x7F51;&#x7EDC;&#x3002;&#x5B83;&#x4F9D;&#x8D56;&#x4E00;&#x79CD;&#x540D;&#x4E3A;LuaJIT&#x7684;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x79CD;&#x8BED;&#x8A00;&#x57FA;&#x4E8E;Lua&#x3002;</p>
<p>&#x76F8;&#x5173;&#x94FE;&#x63A5;&#xFF1A;<a href="http://torch.ch" target="_blank" rel="noopener">http://torch.ch</a></p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2017-01-17T09:26:11.000Z" itemprop="datePublished">2017-01-17</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a href="/blog/2017/01/19/20170119/" class="ui tiny button">

                    <i class="angle left icon"></i>
                    
                    互联网名人汇
                    

                </a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/blog/2017/01/16/20170116/" class="ui tiny button">
                    
                    未雪
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2019 <a href="/">GENERALTUNE</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/blog/js/semantic-ui-algolia.js"></script>

<script src="/blog/js/aloha-events.js"></script>



</body>
</html>
