

<!DOCTYPE html>
<html lang>
<head prefix="og: http://ogp.me/ns#"><meta name="generator" content="Hexo 3.9.0">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content>
    <title>网站性能提升 | generaltune&#39;s blog</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E00;&amp;#x4E2A;&amp;#x6210;&amp;#x719F;&amp;#x7684;&amp;#x5927;&amp;#x578B;&amp;#x7F51;&amp;#x7AD9;&amp;#xFF08;&amp;#x5982;&amp;#x6DD8;&amp;#x5B9D;&amp;#x3001;&amp;#x5929;&amp;#x732B;&amp;#x3001;&amp;#x817E;&amp;#x8BAF;&amp;#x7B49;&amp;#xFF09;&amp;#x7684;&amp;#x7CFB;">
<meta property="og:type" content="article">
<meta property="og:title" content="网站性能提升">
<meta property="og:url" content="https://generaltune.github.io/myblog/2017/11/25/web-performance-improvement/index.html">
<meta property="og:site_name" content="generaltune&#39;s blog">
<meta property="og:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E00;&amp;#x4E2A;&amp;#x6210;&amp;#x719F;&amp;#x7684;&amp;#x5927;&amp;#x578B;&amp;#x7F51;&amp;#x7AD9;&amp;#xFF08;&amp;#x5982;&amp;#x6DD8;&amp;#x5B9D;&amp;#x3001;&amp;#x5929;&amp;#x732B;&amp;#x3001;&amp;#x817E;&amp;#x8BAF;&amp;#x7B49;&amp;#xFF09;&amp;#x7684;&amp;#x7CFB;">
<meta property="og:locale" content="default">
<meta property="og:updated_time" content="2019-07-23T06:00:58.039Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="网站性能提升">
<meta name="twitter:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x4E00;&amp;#x4E2A;&amp;#x6210;&amp;#x719F;&amp;#x7684;&amp;#x5927;&amp;#x578B;&amp;#x7F51;&amp;#x7AD9;&amp;#xFF08;&amp;#x5982;&amp;#x6DD8;&amp;#x5B9D;&amp;#x3001;&amp;#x5929;&amp;#x732B;&amp;#x3001;&amp;#x817E;&amp;#x8BAF;&amp;#x7B49;&amp;#xFF09;&amp;#x7684;&amp;#x7CFB;">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "GENERALTUNE",
  "url": "https://generaltune.github.io/myblog"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/myblog/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>generaltune&#39;s blog</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/myblog/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">GENERALTUNE</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/myblog" class="item">
        <i class="主页 icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-web-performance-improvement" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    网站性能提升
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>&#x524D;&#x8A00;<br>&#x4E00;&#x4E2A;&#x6210;&#x719F;&#x7684;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#xFF08;&#x5982;&#x6DD8;&#x5B9D;&#x3001;&#x5929;&#x732B;&#x3001;&#x817E;&#x8BAF;&#x7B49;&#xFF09;&#x7684;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x65F6;&#x5C31;&#x5177;&#x5907;&#x5B8C;&#x6574;&#x7684;&#x9AD8;&#x6027;&#x80FD;&#x3001;&#x9AD8;&#x53EF;&#x7528;&#x3001;&#x9AD8;&#x4F38;&#x7F29;&#x7B49;&#x7279;&#x6027;&#x7684;&#xFF0C;&#x5B83;&#x662F;&#x968F;&#x7740;&#x7528;&#x6237;&#x91CF;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x7684;&#x6269;&#x5C55;&#x9010;&#x6E10;&#x6F14;&#x53D8;&#x5B8C;&#x5584;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5F00;&#x53D1;&#x6A21;&#x5F0F;&#x3001;&#x6280;&#x672F;&#x67B6;&#x6784;&#x3001;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x4E5F;&#x53D1;&#x751F;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x5C31;&#x8FDE;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x4E5F;&#x4ECE;&#x51E0;&#x4E2A;&#x4EBA;&#x53D1;&#x5C55;&#x5230;&#x4E00;&#x4E2A;&#x90E8;&#x95E8;&#x751A;&#x81F3;&#x4E00;&#x6761;&#x4EA7;&#x54C1;&#x7EBF;&#x3002;&#x6240;&#x4EE5;&#x6210;&#x719F;&#x7684;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x662F;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x7684;&#x6269;&#x5C55;&#x800C;&#x9010;&#x6B65;&#x5B8C;&#x5584;&#x7684;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x8E74;&#x800C;&#x5C31;&#xFF1B;&#x4E0D;&#x540C;&#x4E1A;&#x52A1;&#x7279;&#x5F81;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F1A;&#x6709;&#x5404;&#x81EA;&#x7684;&#x4FA7;&#x91CD;&#x70B9;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x6DD8;&#x5B9D;&#xFF0C;&#x8981;&#x89E3;&#x51B3;&#x6D77;&#x91CF;&#x7684;&#x5546;&#x54C1;&#x4FE1;&#x606F;&#x7684;&#x641C;&#x7D22;&#x3001;&#x4E0B;&#x5355;&#x3001;&#x652F;&#x4ED8;&#xFF0C;&#x4F8B;&#x5982;&#x817E;&#x8BAF;&#xFF0C;&#x8981;&#x89E3;&#x51B3;&#x6570;&#x4EBF;&#x7528;&#x6237;&#x7684;&#x5B9E;&#x65F6;&#x6D88;&#x606F;&#x4F20;&#x8F93;&#xFF0C;&#x767E;&#x5EA6;&#x5B83;&#x8981;&#x5904;&#x7406;&#x6D77;&#x91CF;&#x7684;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x6709;&#x5404;&#x81EA;&#x7684;&#x4E1A;&#x52A1;&#x7279;&#x6027;&#xFF0C;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x4E5F;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x7F51;&#x7AD9;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x627E;&#x51FA;&#x5176;&#x4E2D;&#x5171;&#x7528;&#x4F18;&#x5316;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4F18;&#x5316;&#x6280;&#x672F;&#x548C;&#x624B;&#x6BB5;&#x5E7F;&#x6CDB;&#x8FD0;&#x7528;&#x5728;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x7CFB;&#x7EDF;&#x7684;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x4E0B;&#x9762;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x8BA4;&#x8BC6;&#x8FD9;&#x4E9B;&#x4F18;&#x5316;&#x6027;&#x80FD;&#x7684;&#x6280;&#x672F;&#x548C;&#x624B;&#x6BB5;&#x3002;</p>
<h3 id="&#x6570;&#x636E;&#x5E94;&#x7528;&#x6587;&#x4EF6;&#x5206;&#x79BB;"><a href="#&#x6570;&#x636E;&#x5E94;&#x7528;&#x6587;&#x4EF6;&#x5206;&#x79BB;" class="headerlink" title="&#x6570;&#x636E;&#x5E94;&#x7528;&#x6587;&#x4EF6;&#x5206;&#x79BB;"></a>&#x6570;&#x636E;&#x5E94;&#x7528;&#x6587;&#x4EF6;&#x5206;&#x79BB;</h3><pre><code>&#x6700;&#x5F00;&#x59CB;&#x7684;&#x7F51;&#x7AD9;&#x67B6;&#x6784;
&#x6700;&#x521D;&#x4E1A;&#x52A1;&#x91CF;&#x4E0D;&#x5927;&#xFF0C;&#x8BBF;&#x95EE;&#x91CF;&#x5C0F;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3001;&#x6570;&#x636E;&#x5E93;&#x3001;&#x6587;&#x4EF6;&#x90FD;&#x90E8;&#x7F72;&#x5728;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x6709;&#x4E9B;&#x751A;&#x81F3;&#x4EC5;&#x4EC5;&#x662F;&#x79DF;&#x7528;&#x4E3B;&#x673A;&#x7A7A;&#x95F4; 
&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3001;&#x6570;&#x636E;&#x5E93;&#x3001;&#x6587;&#x4EF6;&#x5404;&#x81EA;&#x90E8;&#x7F72;&#x5728;&#x72EC;&#x7ACB;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x5E76;&#x4E14;&#x6839;&#x636E;&#x670D;&#x52A1;&#x5668;&#x7684;&#x7528;&#x9014;&#x914D;&#x7F6E;&#x4E0D;&#x540C;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x8FBE;&#x5230;&#x6700;&#x4F73;&#x7684;&#x6027;&#x80FD;&#x6548;&#x679C;&#x3002;</code></pre><h3 id="&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x6280;&#x672F;"><a href="#&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x6280;&#x672F;" class="headerlink" title="&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x6280;&#x672F;"></a>&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x6280;&#x672F;</h3><pre><code>&#x672C;&#x5730;&#x7F13;&#x5B58;
2.1 &#x672C;&#x5730;&#x7F13;&#x5B58;
&#x672C;&#x5730;&#x7F13;&#x5B58;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#x662F;&#x5C06;&#x6570;&#x636E;&#x7F13;&#x5B58;&#x5728;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x672C;&#x5730;&#xFF0C;&#x53EF;&#x4EE5;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5B58;&#x5728;&#x6587;&#x4EF6;&#xFF0C;&#x7EC4;&#x4EF6;&#x3002;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x7684;&#x7279;&#x70B9;&#x662F;&#x901F;&#x5EA6;&#x5FEB;&#xFF0C;&#x4F46;&#x56E0;&#x4E3A;&#x672C;&#x5730;&#x7A7A;&#x95F4;&#x6709;&#x9650;&#x6240;&#x4EE5;&#x7F13;&#x5B58;&#x6570;&#x636E;&#x91CF;&#x4E5F;&#x6709;&#x9650;&#x3002;OSCache&#x5C31;&#x662F;&#x5E38;&#x7528;&#x7684;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x3002; 
&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;
&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;&#x7684;&#x7279;&#x70B9;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x7F13;&#x5B58;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x6269;&#x5C55;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#xFF0C;&#x5728;&#x95E8;&#x6237;&#x7C7B;&#x7F51;&#x7AD9;&#x4E2D;&#x5E38;&#x5E38;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x901F;&#x5EA6;&#x6309;&#x7406;&#x6CA1;&#x6709;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x5FEB;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;&#x662F;Memcached&#x3001;Redis&#x3002; 
&#x53CD;&#x5411;&#x4EE3;&#x7406;
&#x90E8;&#x7F72;&#x5728;&#x7F51;&#x7AD9;&#x7684;&#x673A;&#x623F;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x8FBE;&#x5230;&#x65F6;&#x9996;&#x5148;&#x8BBF;&#x95EE;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x7F13;&#x5B58;&#x7684;&#x6570;&#x636E;&#x8FD4;&#x56DE;&#x7ED9;&#x7528;&#x6237;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7F13;&#x5B58;&#x6570;&#x636E;&#x624D;&#x4F1A;&#x7EE7;&#x7EED;&#x8BBF;&#x95EE;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x83B7;&#x53D6;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x51CF;&#x5C11;&#x4E86;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x6210;&#x672C;&#x3002;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x6709;Squid&#xFF0C;Nginx&#x3002; 
CDN
&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x90FD;&#x90E8;&#x7F72;&#x5728;&#x676D;&#x5DDE;&#x7684;&#x673A;&#x623F;&#xFF0C;&#x5BF9;&#x4E8E;&#x6D59;&#x6C5F;&#x7684;&#x7528;&#x6237;&#x6765;&#x8BF4;&#x8BBF;&#x95EE;&#x662F;&#x8F83;&#x5FEB;&#x7684;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x5317;&#x4EAC;&#x7684;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x662F;&#x8F83;&#x6162;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x6D59;&#x6C5F;&#x548C;&#x5317;&#x4EAC;&#x5206;&#x522B;&#x5C5E;&#x4E8E;&#x7535;&#x4FE1;&#x548C;&#x8054;&#x901A;&#x7684;&#x4E0D;&#x540C;&#x53D1;&#x8FBE;&#x5730;&#x533A;&#xFF0C;&#x5317;&#x4EAC;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x8DEF;&#x7531;&#x5668;&#x7ECF;&#x8FC7;&#x8F83;&#x957F;&#x7684;&#x8DEF;&#x5F84;&#x624D;&#x80FD;&#x8BBF;&#x95EE;&#x5230;&#x676D;&#x5DDE;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD4;&#x56DE;&#x8DEF;&#x5F84;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x6240;&#x4EE5;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x65F6;&#x95F4;&#x6BD4;&#x8F83;&#x957F;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5E38;&#x5E38;&#x4F7F;&#x7528;CDN&#x89E3;&#x51B3;&#xFF0C;CDN&#x5C06;&#x6570;&#x636E;&#x5185;&#x5BB9;&#x7F13;&#x5B58;&#x5230;&#x8FD0;&#x8425;&#x5546;&#x7684;&#x673A;&#x623F;&#xFF0C;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x65F6;&#x5148;&#x4ECE;&#x6700;&#x8FD1;&#x7684;&#x8FD0;&#x8425;&#x5546;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x4E86;&#x7F51;&#x7EDC;&#x8BBF;&#x95EE;&#x7684;&#x8DEF;&#x5F84;&#x3002;&#x6BD4;&#x8F83;&#x4E13;&#x4E1A;&#x7684;CDN&#x8FD0;&#x8425;&#x5546;&#x6709;&#x84DD;&#x6C5B;&#x3001;&#x7F51;&#x5BBF;&#x3002;</code></pre><h3 id="&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#xFF0B;-&#x8D1F;&#x8F7D;&#x5747;&#x8861;"><a href="#&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#xFF0B;-&#x8D1F;&#x8F7D;&#x5747;&#x8861;" class="headerlink" title="&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#xFF0B;&#x3000;&#x8D1F;&#x8F7D;&#x5747;&#x8861;"></a>&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#xFF0B;&#x3000;&#x8D1F;&#x8F7D;&#x5747;&#x8861;</h3><pre><code>&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x4F5C;&#x4E3A;&#x7F51;&#x7AD9;&#x7684;&#x5165;&#x53E3;&#xFF0C;&#x4F1A;&#x627F;&#x62C5;&#x5927;&#x91CF;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x6765;&#x5206;&#x62C5;&#x8BF7;&#x6C42;&#x6570;&#x3002;
&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x524D;&#x9762;&#x90E8;&#x7F72;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x670D;&#x52A1;&#x5668;&#x8C03;&#x5EA6;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#xFF0C;&#x6839;&#x636E;&#x5206;&#x53D1;&#x7B56;&#x7565;&#x5C06;&#x8BF7;&#x6C42;&#x5206;&#x53D1;&#x5230;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x8282;&#x70B9;&#x3002; 
&#x5E38;&#x7528;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x6280;&#x672F;&#x786C;&#x4EF6;&#x7684;&#x6709;F5&#xFF0C;&#x4EF7;&#x683C;&#x6BD4;&#x8F83;&#x8D35;&#x4E00;&#x822C;&#x90FD;&#x5728;15W&#x4EE5;&#x4E0A;&#x3002;
    &#x8F6F;&#x4EF6;&#x7684;&#x6709;LVS&#x3001;Nginx&#x3001;HAProxy&#x3002;LVS&#x662F;&#x56DB;&#x5C42;&#xFF08;&#x4F20;&#x8F93;&#x5C42;&#xFF09;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF0C;&#x6839;&#x636E;&#x76EE;&#x6807;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x9009;&#x62E9;&#x5185;&#x90E8;&#x670D;&#x52A1;&#x5668;&#xFF0C;Nginx&#x548C;HAProxy&#x662F;&#x4E03;&#x5C42;&#xFF08;&#x5E94;&#x7528;&#x5C42;&#xFF09;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x62A5;&#x6587;&#x5185;&#x5BB9;&#x9009;&#x62E9;&#x5185;&#x90E8;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x56E0;&#x6B64;LVS&#x5206;&#x53D1;&#x8DEF;&#x5F84;&#x4F18;&#x4E8E;Nginx &#x548C;HAProxy&#xFF0C;&#x6027;&#x80FD;&#x8981;&#x9AD8;&#x4E9B;&#xFF0C;&#x800C;Nginx&#x548C;HAProxy&#x5219;&#x66F4;&#x5177;&#x914D;&#x7F6E;&#x6027;&#xFF0C;&#x5982;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x505A;&#x52A8;&#x9759;&#x5206;&#x79BB;&#xFF08;&#x6839;&#x636E;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x7279;&#x5F81;&#xFF0C;&#x9009;&#x62E9;&#x9759;&#x6001;&#x8D44;&#x6E90;&#x670D;&#x52A1;&#x5668;&#x8FD8;&#x662F;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#xFF09;&#x3002;</code></pre><h3 id="&#x6570;&#x636E;&#x5E93;&#x4F18;&#x5316;"><a href="#&#x6570;&#x636E;&#x5E93;&#x4F18;&#x5316;" class="headerlink" title="&#x6570;&#x636E;&#x5E93;&#x4F18;&#x5316;"></a>&#x6570;&#x636E;&#x5E93;&#x4F18;&#x5316;</h3><pre><code>&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x548C;&#x5206;&#x5E93;&#x5206;&#x8868;
4.1 &#x8BFB;&#x5199;&#x5206;&#x79BB;&#x548C;&#x5206;&#x5E93;&#x5206;&#x8868;
&#x968F;&#x7740;&#x7528;&#x6237;&#x91CF;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x6210;&#x4E3A;&#x6700;&#x5927;&#x7684;&#x74F6;&#x9888;&#xFF0C;&#x6539;&#x5584;&#x6570;&#x636E;&#x5E93;&#x6027;&#x80FD;&#x5E38;&#x7528;&#x7684;&#x624B;&#x6BB5;&#x662F;&#x8FDB;&#x884C;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x4EE5;&#x53CA;&#x5206;&#x5E93;&#x5206;&#x8868;&#xFF0C;&#x8BFB;&#x5199;&#x5206;&#x79BB;&#x987E;&#x540D;&#x601D;&#x4E49;&#x5C31;&#x662F;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x5206;&#x4E3A;&#x8BFB;&#x5E93;&#x548C;&#x5199;&#x5E93;&#xFF0C;&#x901A;&#x8FC7;&#x4E3B;&#x5907;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x540C;&#x6B65;&#x3002;&#x5206;&#x5E93;&#x5206;&#x8868;&#x5219;&#x5206;&#x4E3A;&#x6C34;&#x5E73;&#x5207;&#x5206;&#x548C;&#x5782;&#x76F4;&#x5207;&#x5206;&#xFF0C;&#x6C34;&#x5E73;&#x5207;&#x5206;&#x5219;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7279;&#x5927;&#x7684;&#x8868;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#xFF0C;&#x4F8B;&#x5982;&#x7528;&#x6237;&#x8868;&#x3002;&#x5782;&#x76F4;&#x5207;&#x5206;&#x5219;&#x662F;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x7684;&#x4E0D;&#x540C;&#x6765;&#x5207;&#x5206;&#xFF0C;&#x5982;&#x7528;&#x6237;&#x4E1A;&#x52A1;&#x3001;&#x5546;&#x54C1;&#x4E1A;&#x52A1;&#x76F8;&#x5173;&#x7684;&#x8868;&#x653E;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002; 
&#x4F7F;&#x7528;NoSQL&#x548C;&#x641C;&#x7D22;&#x5F15;&#x64CE;
4.2 &#x4F7F;&#x7528;NoSql&#x6570;&#x636E;&#x5E93;&#x548C;&#x641C;&#x7D22;&#x5F15;&#x64CE;
&#x5BF9;&#x4E8E;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x67E5;&#x8BE2;&#x548C;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;nosql&#x6570;&#x636E;&#x5E93;&#x52A0;&#x4E0A;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x8981;&#x653E;&#x5728;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x4E2D;&#x3002;&#x5E38;&#x7528;&#x7684;NOSQL&#x6709;mongodb&#x3001;hbase&#x3001;redis&#xFF0C;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x6709;lucene&#x3001;solr&#x3001;elasticsearch&#x3002; </code></pre><h3 id="&#x4E1A;&#x52A1;&#x62C6;&#x5206;-&#x5FAE;&#x670D;&#x52A1;&#x2026;"><a href="#&#x4E1A;&#x52A1;&#x62C6;&#x5206;-&#x5FAE;&#x670D;&#x52A1;&#x2026;" class="headerlink" title="&#x4E1A;&#x52A1;&#x62C6;&#x5206;&#x3000;&#x5FAE;&#x670D;&#x52A1;&#x2026;"></a>&#x4E1A;&#x52A1;&#x62C6;&#x5206;&#x3000;&#x5FAE;&#x670D;&#x52A1;&#x2026;</h3><pre><code>&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x81C3;&#x80BF;&#xFF0C;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x4E1A;&#x52A1;&#x62C6;&#x5206;&#xFF0C;&#x5982;&#x767E;&#x5EA6;&#x5206;&#x4E3A;&#x65B0;&#x95FB;&#x3001;&#x7F51;&#x9875;&#x3001;&#x56FE;&#x7247;&#x7B49;&#x4E1A;&#x52A1;&#x3002;&#x6BCF;&#x4E2A;&#x4E1A;&#x52A1;&#x5E94;&#x7528;&#x8D1F;&#x8D23;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x7684;&#x4E1A;&#x52A1;&#x8FD0;&#x4F5C;&#x3002;&#x4E1A;&#x52A1;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x6D88;&#x606F;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x6216;&#x8005;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x5E93;&#x6765;&#x5B9E;&#x73B0;&#x3002; </code></pre><h3 id="&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;"><a href="#&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;" class="headerlink" title="&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;"></a>&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;</h3><pre><code>&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;
6.1 &#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;
&#x7528;&#x6237;&#x4E00;&#x5929;&#x5929;&#x589E;&#x52A0;&#xFF0C;&#x4E1A;&#x52A1;&#x91CF;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x4EA7;&#x751F;&#x7684;&#x6587;&#x4EF6;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x5355;&#x53F0;&#x7684;&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x5DF2;&#x7ECF;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x9700;&#x8981;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x652F;&#x6491;&#x3002;&#x5E38;&#x7528;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6709;GFS&#x3001;HDFS&#x3001;TFS&#x3002;
GFS&#xFF08;Google File System&#xFF09;&#x53EF;&#x4EE5;&#x7ED9;&#x5927;&#x91CF;&#x7684;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x603B;&#x4F53;&#x6027;&#x80FD;&#x8F83;&#x9AD8;&#x7684;&#x670D;&#x52A1;
&#x2022; &#x9002;&#x5408;&#x90E8;&#x7F72;&#x5728;&#x5EC9;&#x4EF7;&#x7684;&#x666E;&#x901A;&#x786C;&#x4EF6;&#x4E0A;
&#x2022; &#x63D0;&#x4F9B;&#x5BB9;&#x9519;&#x529F;&#x80FD;

HDFS&#xFF08;Hadoop Distributed File System&#xFF09;&#x80FD;&#x63D0;&#x4F9B;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x7684;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#xFF0C;&#x975E;&#x5E38;&#x9002;&#x5408;&#x5927;&#x89C4;&#x6A21;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x7684;&#x5E94;&#x7528;
&#x2022; &#x8FD0;&#x884C;&#x5728;&#x901A;&#x7528;&#x786C;&#x4EF6;(commodityhardware)
&#x2022; &#x9AD8;&#x5EA6;&#x5BB9;&#x9519;
&#x2022; &#x9002;&#x5408;&#x90E8;&#x7F72;&#x5728;&#x5EC9;&#x4EF7;&#x7684;&#x673A;&#x5668;&#x4E0A;

TFS&#xFF08;Taobao Flies System&#xFF09;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x6D77;&#x91CF;&#x7684;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#xFF0C;&#x63D0;&#x4F9B;&#x9AD8;&#x53EF;&#x9760;&#x548C;&#x9AD8;&#x5E76;&#x53D1;&#x7684;&#x5B58;&#x50A8;&#x8BBF;&#x95EE;
&#x2022; &#x9AD8;&#x53EF;&#x6269;&#x5C55;&#x3001;&#x9AD8;&#x53EF;&#x7528;&#x3001;&#x9AD8;&#x6027;&#x80FD;
&#x2022; &#x9762;&#x5411;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;
&#x2022; &#x9002;&#x5408;&#x6D77;&#x91CF;&#x5C0F;&#x6587;&#x4EF6;&#x5B58;&#x50A8;

&#x5206;&#x5E03;&#x5F0F;&#x670D;&#x52A1;
6.2 &#x5206;&#x5E03;&#x5F0F;&#x670D;&#x52A1;
&#x5404;&#x4E2A;&#x4E1A;&#x52A1;&#x5E94;&#x7528;&#x90FD;&#x4F1A;&#x4F7F;&#x7528;&#x5230;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x4E1A;&#x52A1;&#x670D;&#x52A1;&#xFF0C;&#x4F8B;&#x5982;&#x7528;&#x6237;&#x670D;&#x52A1;&#x3001;&#x8BA2;&#x5355;&#x670D;&#x52A1;&#x3001;&#x652F;&#x4ED8;&#x670D;&#x52A1;&#x3001;&#x5B89;&#x5168;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x662F;&#x652F;&#x6491;&#x5404;&#x4E1A;&#x52A1;&#x5E94;&#x7528;&#x7684;&#x57FA;&#x672C;&#x8981;&#x7D20;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x62BD;&#x53D6;&#x51FA;&#x6765;&#x5229;&#x7528;&#x5206;&#x90E8;&#x5F0F;&#x670D;&#x52A1;&#x6846;&#x67B6;&#x642D;&#x5EFA;&#x5206;&#x5E03;&#x5F0F;&#x670D;&#x52A1;&#x3002;&#x963F;&#x91CC;&#x7684;Dubbo&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002;</code></pre><h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><pre><code>&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x7684;&#x67B6;&#x6784;&#x662F;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x4E0D;&#x65AD;&#x5B8C;&#x5584;&#x7684;&#xFF0C;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x7279;&#x5F81;&#x4F1A;&#x505A;&#x7279;&#x5B9A;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x8003;&#x8651;&#xFF0C;&#x672C;&#x6587;&#x53EA;&#x662F;&#x8BB2;&#x8FF0;&#x4E00;&#x4E2A;&#x5E38;&#x89C4;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x4F1A;&#x6D89;&#x53CA;&#x7684;&#x4E00;&#x4E9B;&#x4F18;&#x5316;&#x6280;&#x672F;&#x548C;&#x624B;&#x6BB5;&#x3002;</code></pre><p><a href="http://geek.csdn.net/news/detail/245449" target="_blank" rel="noopener">&#x8F6C;&#x8F7D;&#x539F;&#x6587;&#x94FE;&#x63A5;</a><br><a href="http://www.cnblogs.com/leefreeman/p/3993449.html" target="_blank" rel="noopener">&#x8F6C;&#x8F7D;&#x539F;&#x6587;&#x94FE;&#x63A5;</a></p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2017-11-25T02:28:20.000Z" itemprop="datePublished">2017-11-25</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a href="/myblog/2017/12/01/nice-sites/" class="ui tiny button">

                    <i class="angle left icon"></i>
                    
                    nice websites
                    

                </a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/myblog/2017/11/23/nc-note/" class="ui tiny button">
                    
                    nc_note
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    <ol class="ui ordered list"><li><a href="#数据应用文件分离"><span>数据应用文件分离</span></a></li><li><a href="#使用缓存技术"><span>使用缓存技术</span></a></li><li><a href="#服务器集群＋-负载均衡"><span>服务器集群＋　负载均衡</span></a></li><li><a href="#数据库优化"><span>数据库优化</span></a></li><li><a href="#业务拆分-微服务…"><span>业务拆分　微服务…</span></a></li><li><a href="#分布式系统"><span>分布式系统</span></a></li></ol><li><a href="#总结"><span>总结</span></a>
                </li></div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2020 <a href="/">GENERALTUNE</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/myblog/js/semantic-ui-algolia.js"></script>

<script src="/myblog/js/aloha-events.js"></script>



</body>
</html>
